{"/2024/":{"data":{"":"Tag 1 Erster Advent Tag 2 Tag 3 Tag 4 Tag 5 Tag 6 Tag 7 Tag 8 Zweiter Advent Tag 9 Tag 10 Tag 11 Tag 12 Tag 13 Tag 14 Tag 15 Dritter Advent Tag 16 Tag 17 Tag 18 Tag 19 Tag 20 Tag 21 Tag 22 Vierter Advent Tag 23 Tag 24 Heilig Abend Epilog"},"title":"2024"},"/2024/1/":{"data":{"":"Der Nordpol summt vor Energie, während die Elfen sich auf eine weitere Weihnachtssaison vorbereiten. Im Inneren von Santas Werkstatt surren Zahnräder, und Lichter blitzen auf, während Tausende von Spielzeugen von den Fließbändern rollen. Doch irgendetwas fühlt sich … falsch an.\nDavid Snowell, einer von Santas besten Ingenieurs-Elfen, stürmt in die Haupthalle, wo du und Wesley Snow gerade neben dem Zuckerstangen-Spender plaudert. „Wir haben ein Problem“, sagt David und hält ein blinkendes rotes Gerät hoch. „Es gibt eine Anomalie in der Temporalen Singularitätskammer.“\nDie Elfen verstummen. Die TSK ist das Herzstück des Betriebs; sie enthält das Schwarze Loch, das die Zeit für die Fabrik verlangsamt. Ohne sie hätten die Elfen nicht genug Zeit, um Milliarden von Geschenken vor Weihnachten zu produzieren.\nDavid führt euch zum Kontrollraum der TSK. Auf den Monitoren seht ihr verzerrte Anzeigen und flimmernde Bilder des Schwarzen Lochs. Neben der Kontrollkonsole liegen eine Schachstellung und eine zerrissene Weihnachtsmann-Maske.\n„Das muss Grinchuk sein“, sagt Wesley. „Er ist zurück.“\nDavid nickt. „Wir müssen die TSK stabilisieren, bevor sie kollabiert. Der erste Schritt ist es, diese Stellung nach dem 6. Zug von Weiß zu erreichen.“\nrnb1kbnr/ppp1pppp/8/3p1q2/8/5PK1/PPPPP1PP/RNBQ1BNR b kq - 0 1"},"title":"Tag 1 - 2024 - Stellungsmatt"},"/2024/1/loesung/":{"data":{"":"**1. f3 d6 2. Kf2 Dd7 3. Ke3 Dh3 4. Ke4 d5+ 5. Kf4 Df5+ 6. Kg3 ***"},"title":"Tag 1 - 2024 - Lösung"},"/2024/10/":{"data":{"":"Die schwere Tür zur Kryostasekammer zischt auf und entlässt eine eisige Luftwelle. Drinnen leuchtet eine zylindrische Kapsel schwach, Frost haftet an ihrer Oberfläche. Santa liegt darin, vollkommen regungslos, sein ikonischer Anzug wird schwach vom Licht der Kammer erhellt.\nWesley tritt näher heran. „Er ist immer noch eingefroren… aber schau dir das an.“ Er zeigt auf ein Wirrwarr von Kabeln, die aus dem Bedienfeld der Kapsel hängen. Mehrere Komponenten scheinen gelockert, und ein kleines Werkzeug liegt in der Nähe, als hätte jemand daran herumgefummelt.\nDavids Gesicht verdüstert sich. „Das war kein Unfall. Jemand war hier.“\nMagnus verengt die Augen. „Grinchuk?“\n„Möglich“, antwortet David, während er den Schaden sorgfältig untersucht. „Wenn das nicht repariert wird, könnte die Kammer komplett ausfallen. Santa würde für immer in seinem gefrorenen Zustand bleiben.“\nWesley runzelt die Stirn. „Können wir das reparieren?“\nDavid nickt. „Wir müssen. Aber dafür müssen wir die Energie umleiten und das System neu kalibrieren. Der erste Schritt ist, einen Weg zu finden, Schwarz hier schachmatt zu setzen.“\nDies ist ein Hilfe-Matt-Problem, was bedeutet, dass beide Spieler kooperieren, um das Matt zu erreichen.\nMit Schwarz am Zug: Wie kann Weiß mit Unterstützung von Schwarz im vierten Zug Matt setzen? Schwarz spielt 4 Züge und Weiß ebenfalls 4, wobei der vierte Zug von Weiß das Matt ist.\nk1B5/1p6/8/3p4/3P2Pp/2n1KP1P/pppp1p1R/B3b3 b - - 0 1"},"title":"Tag 10 - 2024 - Hilfsmatt"},"/2024/10/loesung/":{"data":{"":"b1=T Lxc3 2. d1=T Lxe1 3. f1=T Lg3 4. c1=T Txa2#"},"title":"Tag 10 - 2024 - Lösung"},"/2024/11/":{"data":{"":"David untersucht die Konsole, seine Miene angespannt. “Die Umleitung der Energie hat nicht funktioniert. Santa soll eigentlich erst in zwei Wochen aufwachen. Die Kryo-Systeme sind für ein langsames Auftauen programmiert, das genau auf den 24. abgestimmt ist.”\nMagnus runzelt die Stirn. “Aber mit der Manipulation ist Warten keine Option, oder?”\nDavid schüttelt den Kopf. “Nein. Wenn wir ihn jetzt nicht da rausholen, könnte er nie mehr aufwachen. Wir müssen ihn dieses Jahr früher wecken.”\nDavid beginnt, Befehle in die Konsole einzugeben. “Das wird noch kein vollständiges Aufwecken sein, aber wir starten den Auftauprozess. Sobald sich die Kammer an normale Bedingungen angepasst hat, holen wir ihn heraus.”\nDie Kammer summt leise, während warme Luft zirkuliert und der Frost langsam vom Glas zurückweicht. Santas Gestalt bleibt unbeweglich, das rhythmische Pulsieren der Konsolenlichter ist das einzige Zeichen dafür, dass der Prozess begonnen hat.\nDavid tritt zurück und beobachtet, wie der Frost langsam schmilzt. “Jetzt heißt es warten. Das wird ein paar Stunden dauern.”\nMagnus lässt sich auf einen nahegelegenen Stuhl sinken. “Na gut, während wir warten, können wir unsere Köpfe scharf halten. Lass uns dieses Schachproblem lösen.”\nIn der aktuellen Stellung hat Weiß gerade einen Zug ausgeführt. Ziehe zuerst den letzten Zug von Weiß zurück, gefolgt vom letzten Zug von Schwarz. Setze dann das Spiel fort, indem Schwarz einen legalen Zug macht, gefolgt von einem Zug von Weiß, der ein Schachmatt liefert. Dies ist ein Hilfe-Rückzug, also kooperieren beide Spieler.\nDu brauchst die beiden zurückgenommenen Halbzüge nicht anzugeben, nur die beiden Züge, die nach der Rücknahme gespielt werden: zuerst ein Zug von Schwarz, dann ein Zug von Weiß, der das Schachmatt liefert.\n2rkQ3/1K6/8/8/8/8/3R1P2/4b3 b - - 0 1"},"title":"Tag 11 - 2024 - Retract"},"/2024/11/loesung/":{"data":{"":"Zuerst nehmen wir den Zug dxTe8=D zurück und anschließend e2-e1=L. Dann spielen wir vorwärts: 1. e1=T dxc8=S#"},"title":"Tag 11 - 2024 - Lösung"},"/2024/12/":{"data":{"":"Das sanfte Zischen der Kammer erfüllt den Raum, während der Frost weiter schmilzt. Im Inneren werden Santas Züge deutlicher—sein dichter Bart ist mit eisigen Tropfen bedeckt, sein Gesicht friedlich, aber bleich.\nDavid überprüft die Diagnosedaten auf der Konsole. “Der Auftauprozess verläuft reibungslos. Er sollte bald wieder zu Bewusstsein kommen.”\nMagnus lehnt sich an die Konsole. “Was glaubst du, wie er reagieren wird?”\nWesley verzieht das Gesicht. “Nicht gut. Stell dir vor, du wachst auf und denkst, du bist bereit für Weihnachten, nur um herauszufinden, dass es noch zwei Wochen zu früh ist.”\nDavid atmet aus. “Wir werden damit umgehen, wenn es soweit ist. Im Moment müssen wir sicherstellen, dass dieser Prozess einwandfrei abläuft.”\nDas Summen der Kammer ändert sich und signalisiert die letzte Phase. Drinnen zucken Santas Finger leicht. Ein Zeichen, dass das Leben zurückkehrt.\nMagnus wirft den anderen einen Blick zu. “Los geht’s.”\nDies ist ein Serien-Hilfsmatt. Schwarz führt 9 Züge hintereinander aus, ohne dass Weiß dazwischen zieht, danach setzt Weiß mit einem Zug matt. Beide Seiten kooperieren.\nEs sind keine Zwischen-Schachs erlaubt, was bedeutet, dass Schwarz erst im 9. Zug Schach geben darf.\nK7/1p6/2k1P3/3NP3/2PP4/5N2/8/8 b - - 0 1"},"title":"Tag 12 - 2024 - Serien-Hilfsmatt"},"/2024/12/loesung/":{"data":{"":"b5 2. b4 3. b3 4. b2 5. b1=T 6. Te1 7. Txe5 8. Txe6 9. Td6 Se5#"},"title":"Tag 12 - 2024 - Lösung"},"/2024/13/":{"data":{"":"Santas Augen flattern auf, und er richtet sich langsam in der Kryostasekapsel auf. Blinzelnd lässt er seinen Blick durch den Raum schweifen. “Schlitten bereit?” fragt er.\nWesley schaut zu David, der einen Schritt nach vorne tritt. “Nicht ganz, Sir. Es ist… der 13. Dezember.”\nSantas Stirn runzelt sich, Verwirrung huscht über sein Gesicht. “13. Dezember? Warum bin ich so früh wach?”\nDavid zögert, bevor er antwortet, seine Stimme wohlüberlegt. “Es gab eine Anomalie. Wir werden alles gleich erklären, aber zuerst müssen wir sicherstellen, dass Sie vollständig genesen sind.”\nSanta steigt aus der Kapsel und wischt Frost von seinen scharlachroten Ärmeln. “Anomalie hin oder her, ich nehme an, die Standardtests stehen an?”\nDavid wendet sich dir zu und spricht leise. “Nach einem Jahr in Kryostase führen wir immer kognitive Tests durch, um sicherzustellen, dass alles ordnungsgemäß funktioniert.”\nMagnus deutet auf das Schachbrett, das in der Nähe aufgebaut ist. “Du kennst das Prozedere.”\nSanta nähert sich dem Brett mit ruhiger Vertrautheit. “Gleiche Prozedur wie letztes Jahr?”\nDavid stellt die Figuren sorgfältig auf. “Gleiche Prozedur wie jedes Jahr, James. Weiß am Zug, geschützte Figuren dürfen sich nicht bewegen, Matt in zwei.”\nSanta beugt sich vor, seine scharfen Augen scannen die Stellung. “Mein Name ist nicht James. Aber fangen wir an.”\nIn dieser Stellung darf jede von einer anderen Figur derselben Farbe geschützte Figur sich nicht bewegen. Eine gefesselte Figur zählt jedoch nicht als Schützer, da sie sich nicht bewegen kann. Das bedeutet, dass Sie eine Figur bewegen können, die nur von gefesselten Figuren geschützt wird. Weiß muss in zwei Zügen ein Matt erzwingen. Nur der Schlüsselzug (also der erste Zug von Weiß) wird für die Lösung benötigt. Beachten Sie, dass dies kein Hilfsmatt ist, also muss Weiß unabhängig von der Antwort von Schwarz ein Matt erzwingen können\nkB6/P7/P7/3N4/1P1rp3/1B1pP3/1K1P4/8 w - - 0 1"},"title":"Tag 13 - 2024 - Schlüsselmatt"},"/2024/13/loesung/":{"data":{"":"Kb1"},"title":"Tag 13 - 2024 - Lösung"},"/2024/14/":{"data":{"":"Santa sitzt auf dem zentralen Stuhl im Labor, sein Gesichtsausdruck eine Mischung aus Besorgnis und Neugier, während David die Anomalien erklärt. Nach einem Moment lehnt sich Santa zurück und streicht über seinen Bart. “Eine Anomalie, die ernst genug ist, um mich früh zu wecken. Erzählt mir die ganze Geschichte.”\nMagnus mischt sich ein. “Es geht nicht nur um die Kryokammer. Wir haben es mit Interferenzen durch die Singularität zu tun, die Zeit und Raum in der gesamten Fabrik beeinflussen.”\nDu, noch dabei, die Situation zu begreifen, fragst Santa: “Warum musst du überhaupt jedes Jahr eingefroren werden?”\nDavid wirft dir einen nachdenklichen Blick zu. “Es wird Zeit, dass du verstehst, wie der Betrieb funktioniert,” beginnt er. “Wir haben eine Umgebung um den Schlitten herum konstruiert, die ihn und seine Rentiere vom Rest des Universums isoliert. Das System manipuliert die Raumzeit selbst.”\nMagnus fügt hinzu: “Das Feld komprimiert den Raum vor dem Schlitten und dehnt ihn dahinter aus. Dadurch entsteht eine lokalisierte Raumzeit-Blase, in der alles darin unabhängig von der Außenwelt funktioniert.”\nDavid nickt. “Innerhalb dieser Blase kann der Schlitten Geschwindigkeiten nahe der Lichtgeschwindigkeit erreichen. Während er beschleunigt, greift die Zeitdilatation. Für Santa verlangsamt sich die Zeit dramatisch – was sich wie ein ganzes Jahr in der Blase anfühlt, vergeht draußen nur als eine einzige Nacht.”\nSanta nickt und deutet dann auf das Schachbrett in der Nähe. “Apropos Zeit… Wie ist diese Stellung entstanden?”\nDa diese Stellung durch eine legale Schachpartie erreicht worden sein könnte, welcher war der letzte gespielte Zug? Du musst nur den letzten Zug des zuletzt ziehenden Spielers angeben, nicht für beide. Du musst auch das Feld angeben, von dem die Figur gezogen ist. Wenn eine Figur geschlagen wurde, musst du auch die geschlagene Figur angeben.\nBeispiel: Wenn eine Dame auf b2 nach a3 gezogen ist, schreibst du Db2-a3. Wenn eine Dame auf b2 einen Turm auf a3 schlägt, schreibst du Db2xTa3 (Dxa3 reicht nicht aus).\n3bkN1K/pppprp1p/4p1p1/8/8/8/8/8 w - - 0 1"},"title":"Tag 14 - 2024 - Rückwärtsgewandt"},"/2024/14/loesung/":{"data":{"":"Die einzige Möglichkeit ist, dass Weiß Kg8xDh8 spielt."},"title":"Tag 14 - 2024 - Lösung"},"/2024/15/":{"data":{"":"Du lehnst dich vor, fasziniert. „Also erlebt er ein ganzes Jahr in dem, was sich für uns wie eine einzige Nacht anfühlt?“\nDavid fährt fort: „Genau. Die Umgebung des Schlittens ist so konstruiert, dass dies möglich ist. Die Blase stabilisiert sich mithilfe einer immensen Energiemenge, um die Raumzeit darum herum zu biegen, was es Santa effektiv ermöglicht, große Entfernungen zurückzulegen und dabei die Zeit langsamer zu erleben.“\nSanta lacht leise. „Und glaubt mir, ein Jahr damit, Geschenke auszuliefern, ist genauso anstrengend, wie es klingt.“\nDeine Augen weiten sich. „Aber wenn er jedes Weihnachten ein Jahr erlebt, würde er dann nicht… schneller altern als alle anderen?“\nDavids Ausdruck wird ernst. „Hier kommt die Kryokammer ins Spiel. Nach jeder Reise wird Santa in Kryostase versetzt. Seine Stoffwechselaktivität wird auf nahezu Null reduziert, wodurch er biologisch mit allen anderen synchron bleibt. Ohne diese Maßnahme würde er zwei Jahre altern, während für uns nur ein Jahr vergeht.“\nMagnus neigt den Kopf. „Und wie haltet ihr diese Blase aufrecht, während ihr euch so schnell bewegt?“\nDavid zeigt auf ein holografisches Schema. „Das Feld ist durch eine kontrollierte Verzerrung in der Raumzeit verankert. Durch präzise Manipulation der Gravitationskräfte erzeugen wir einen stabilen Gradienten um den Schlitten herum, der sicherstellt, dass die Blase intakt bleibt und Santa vor den Auswirkungen der externen Beschleunigung geschützt ist.“\nSanta lächelt. „Es ist nicht einfach, aber es funktioniert. Das gesagt, vertraue ich darauf, dass ihr das alles unter Kontrolle habt, während ich mich vorbereite?“\nDavid tauscht einen Blick mit Magnus aus. „Wir tun alles, was wir können. Aber es ist klar, dass jemand, wahrscheinlich Grinchuk, an den Mechanismen herumbastelt.“\nDies ist ein Selbstmatt. Gib die Zugfolge an, die Schwarz zwingt, Weiß im vierten Zug mattzusetzen (beide Spieler machen 4 Züge). Weiß macht den ersten Zug.\n8/1p5Q/bP2P3/1p1B2P1/1B6/4kNp1/5pP1/5K2 w - - 0 1"},"title":"Tag 15 - 2024 - Selbstmatt"},"/2024/15/loesung/":{"data":{"":"Dc7 Kd3 2. Ld2 b4 3. Dc4+ Lxc4 4. Le4+ Kxe4#"},"title":"Tag 15 - 2024 - Lösung"},"/2024/16/":{"data":{"":"Santa richtet sich auf, seine gebieterische Präsenz füllt den Raum, während er die Gesichter um sich herum mustert. „Wenn Grinchuk an den Systemen des Schlittens herumgepfuscht hat, müssen wir wissen, wie tief sein Sabotageakt reicht. Ich nehme an, ihr habt bereits eine Untersuchung eingeleitet?“\nDavid nickt. „Wir überwachen die Anomalien, aber die Störungen durch die TSC machen es schwieriger, seine Manipulationen zu isolieren.“\nMagnus deutet auf die Konsole. „Und die Verzerrungen werden schlimmer. Als ich gerade durch die Fabrik ging, habe ich gesehen, wie eine jüngere Version von mir an einem Schaltplan arbeitete, den ich seit Jahren nicht mehr angerührt habe. Diese Zeitfragmente überschwemmen alles.“\nSanta streicht sich nachdenklich durch den Bart. „Die Instabilität der TSC… ist sie auf die Fabrik beschränkt?“\nDavid schüttelt den Kopf. „Nicht ganz. Sie ist hauptsächlich hier, aber die Effekte strahlen nach außen aus. Das Feld des Schlittens ist mit der TSC verbunden, und wenn wir es nicht stabilisieren können, wird deine Reise dieses Jahr unvorhersehbar sein. Du könntest Geschenke im Jahr 1843 oder 3984 ausliefern, statt 2024.“\nBevor Santa antworten kann, blinkt eine Warnung auf der Konsole auf. Ein verzerrtes Bild erscheint auf dem Monitor – ein flimmerndes Schachbrett, teilweise von Störungen verdeckt. Doch das ist nicht irgendein Brett. Die Figuren sind in einer Stellung angeordnet, die Magnus sofort erkennt.\n„Das ist aus einer Partie, die ich vor Jahrzehnten gespielt habe“, sagt Magnus. „Aber ich erinnere mich nicht daran, wie ich in diese Stellung gekommen bin.“\n„Beginnend mit der Ausgangsposition“, fügt er hinzu, „gib eine Zugfolge an, die diese Stellung nach dem achten Zug von Weiß erreicht (acht Züge für Weiß und sieben für Schwarz).“\nrn2kbnr/p2ppppp/1p6/8/2pP4/5PP1/PP2PB1P/RN2KBNR w KQkq - 0 1"},"title":"Tag 16 - 2024 - Beweis"},"/2024/16/loesung/":{"data":{"":"c4 b5 2. Db3 bxc4 3. Db6 cxb6 4. d4 Dc7 5. Le3 Dg3 6. fxg3 Lb7 7. Lf2 Lf3 8. gxf3"},"title":"Tag 16 - 2024 - Lösung"},"/2024/17/":{"data":{"":"Die Gruppe versammelt sich um die Konsole, deren Bildschirm schwach flackert, während das letzte Rätsel verblasst. David Snowells Gesicht ist angespannt. „Diese Verzerrungen sind nicht mehr nur zufällige Echos. Sie werden gezielter. Sie richten sich gegen uns.“\nMagnus tritt vor und zeigt auf die Konsole, wo ein schwaches Zeitliniendiagramm erscheint. „Schaut hier. Die Fragmente—diese Verzerrungen—sammeln sich um Momente, in denen die TSC mit maximaler Kapazität operierte. Es ist, als ob die Ergosphäre des Schwarzen Lochs Ereignisse aus der Zeitlinie zieht und sie in unsere Realität projiziert.“\nWesley runzelt die Stirn. „Du meinst, die TSC zieht Stücke der Zeit in die Gegenwart? Wie ist das überhaupt möglich?“\nDavid dreht sich um, sein Blick düster. „Das Schwarze Loch im Kern der TSC verlangsamt die Zeit nicht mehr nur. Seine Ergosphäre—die verzerrte Region um den Ereignishorizont—ist destabilisiert. Normalerweise enthält und reguliert sie die Dilatationseffekte der Fabrik, was uns die Jahrzehnte gibt, die wir brauchen, um Weihnachten vorzubereiten. Aber jetzt… leckt sie.“\nSantas Augen verengen sich. „Leckt wohin?“\nDavid deutet auf die verzerrten Bilder auf der Konsole. „Hierhin. Zu uns. Die Verzerrungen sind Fragmente von vergangenen und zukünftigen Momenten, die in die Gegenwart gezogen werden. Grinchuks Manipulationen verstärken diesen Effekt und destabilisieren das Raum-Zeit-Gefüge selbst.“\nMagnus lehnt sich zurück, sein Ausdruck finster. „Und wenn wir es nicht aufhalten können?“\nDavid zögert. „Irgendwann könnte die Zeitdilatation der Fabrik vollständig zusammenbrechen. Wenn das passiert, wird das Schwarze Loch die gesamte Zeitlinie in seine Ergosphäre ziehen. Es könnte Weihnachten aus der gesamten Geschichte auslöschen.“\nBevor die Gruppe antworten kann, blinkt ein weiterer Alarm auf der Konsole. Koordinaten erscheinen auf dem Bildschirm. Davids Augen weiten sich. „Diese führen zur alten Nordpol-Forschungsstation! Dort wurden die TSC-Prototypen ursprünglich gebaut. Wenn Grinchuk dort ist, hat er möglicherweise Zugriff auf die frühen Entwürfe.“\nDie Gruppe packt ihre Ausrüstung und macht sich auf in die eisige Wildnis. Der Schnee wird dichter, der Wind heult um sie herum. Als sie sich den Koordinaten nähern, bleibt Wesley plötzlich stehen und zeigt auf ein schwaches Glitzern in der Ferne. „Was ist das?“\nMagnus späht durch den Schnee. „Es sieht aus wie ein Schachbrett?“\nDie Gruppe nähert sich, und die Umrisse werden klar. Ein gigantisches Schachbrett, dessen Figuren alle im Schnee vergraben sind, erstreckt sich vor ihnen. Die Figuren sind darauf verstreut, alle in Weiß gehüllt, ihre ursprünglichen Farben durch Frost und Eis verborgen.\nDavid kniet neben einer der Figuren nieder. „Diese Partie ist vorbei, ein Schachmatt hat stattgefunden, aber es ist unmöglich zu sagen, zu welcher Seite jede Figur gehört.“\nEiner der Könige steht im Schachmatt. Färbt die Figuren, arbeitet heraus, welche schwarz und welche weiß sind. Gebt die Koordinaten für die weißen Figuren an, gefolgt von einem Komma und dann dem letzten Zug, der zu dieser Position geführt hat.\nBeispielformat: c1 e5 f7, Qf7#\nLeider lässt sich in ChessBase 16 nur eine gültige Stellung aufbauen, weshalb das Bild aus Lichess stammt. Die FEN ist dennoch korrekt. NR1BK3/3Q4/BKP5/P7/8/8/8/1R4B1 w - - 0 1"},"title":"Tag 17 - 2024 - Farbtheorie"},"/2024/17/loesung/":{"data":{"":"Weiße Figuren: Turm auf b1, Bauer auf c6, Dame auf d7, König auf e8, Läufer auf g1. Die restlichen Figuren sind Schwarz. Der letzte Zug war bxc6# en passant!"},"title":"Tag 17 - 2024 - Lösung"},"/2024/18/":{"data":{"":"Die Gruppe betritt die verlassene Forschungsstation, deren Luft unnatürlich still ist. David fährt mit seinem Scanner durch den Raum, seine Miene wird ernster. “Die Gravitationsverzerrungen sind hier stärker – näher am Feld des Schwarzen Lochs, als ich dachte. Dieser Ort ist ein Knotenpunkt.”\nSanta tritt vor, seine Stimme fest. “Und Grinchuk war hier. Schau.”\nIm Zentrum des Raums steht ein Schachbrett, das schwach leuchtet. Drumherum summen alte Maschinen mit Restenergie, und an den Wänden hängen Schemata – grobe Diagramme der TSC. Magnus blinzelt auf das Schachbrett, dessen Figuren auf merkwürdige Weise angeordnet sind.\nDavid runzelt die Stirn und untersucht die nahegelegene Konsole. “Diese Systeme laufen in Rückkopplungsschleifen. Er hat diese Station genutzt, um die Gravitationswellen des Schwarzen Lochs zu verstärken. Wenn er damit weitermacht, verliert die TSC vollständig die Fähigkeit, die Zeitdilatation zu kontrollieren.”\nDie Gruppe versammelt sich um das leuchtende Schachbrett, dessen Figuren mitten im Spiel eingefroren sind. Wesley deutet darauf und runzelt die Stirn. “Wieder eines von Grinchuks Rätseln?”\nDavid scannt das Brett. “Es ist schlimmer als das. Die Verzerrungen der TSC ziehen dieses Brett zwischen zwei Zeitlinien – eine, in der Schachgebote nicht existierten, und eine, in der sie es taten. Das Ergebnis? Schachgebote sind verboten, es sei denn, sie führen direkt zum Schachmatt.”\nSanta tritt erneut vor, seine Stimme ruhig. “Dann lasst es uns lösen. Löse das Rätsel, und wir bringen etwas Ordnung in dieses Chaos.”\nDies ist ein schachgebotloses Hilfsmatt. Jedes Schachgebot, das nicht in einem Schachmatt endet, ist gegen die Regeln. Beide Spieler arbeiten dennoch zusammen, um ein Schachmatt zu erreichen, jedoch ohne Schachgebote. Daher wird ein Schachgebot auch als Schachmatt betrachtet – und damit erlaubt –, wenn die einzigen Antworten nicht schachmattende Schachgebote sind! Schwarz beginnt, dann Weiß. Vier Züge pro Seite. Der letzte Zug von Weiß muss ein Schachmatt sein.\nBeispiel: Hier klicken :) K7/5p1B/5n1P/3k4/8/2p5/8/7n b - - 0 1"},"title":"Tag 18 - 2024 - Schachlos"},"/2024/18/beispiel/":{"data":{"":"Kd7 Kg4 2. f1=L f6 3. La6 f7 4. Lc8 f8=S# Dies ist Schachmatt, weil der schwarze König keine legalen Züge hat, außer solche, die ein Schachgebot sind!"},"title":"Day 18 - 2024 - Beispiel"},"/2024/18/loesung/":{"data":{"":"Ng8 Bb1 2. c2 h7 3. cxb1=B hxg8=N 4. Be4 Ne7#"},"title":"Tag 18 - 2024 - Lösung"},"/2024/19/":{"data":{"":"Die Energie, die durch die Station pulsiert, beginnt zu verblassen, doch die Luft bleibt schwer vor Anspannung. David studiert die Anzeigen auf der Konsole. „Diese Gravitationsverzerrungen sind nicht zufällig. Grinchuk kanalisiert die Energie der TSC in etwas Größeres.“\nSanta tritt näher. „Was genau baut er?“\nDavid zögert und ruft ein Schema auf der Konsole auf. Die leuchtenden Linien formen die Umrisse eines Schlittens, umgeben von wirbelnden Energiefeldern. „Es ist… ein Schlitten“, murmelt David. „Aber das ist nicht wie deiner, Santa. Er ist dafür konzipiert, die Zeitdilatation direkt auszunutzen.“\nMagnus beugt sich vor. „Erklär das.“\nDavid holt tief Luft und zeigt auf die Umrisse auf der Konsole. „Grinchuks Chrono-Schlitten versucht, die Fähigkeit deines Schlittens, die Raumzeit zu biegen, nachzuahmen – aber mit einem Unterschied. Anstatt die Zeit für sich selbst zu verlangsamen, will er eine geschlossene Zeitschleife erschaffen – eine, in der er jeden Moment von Weihnachten kontrolliert und die Geschichte umschreibt, um sich selbst zur zentralen Figur zu machen.“\nWesley starrt auf das Schema. „Also versucht er nicht nur, uns zu sabotieren. Er will uns… auslöschen?“\nDavid nickt ernst. „Wenn er Erfolg hat, verliert die TSC ihren Stabilisationsanker, und die Gravitationskraft des Schwarzen Lochs wird die gesamte Zeitlinie in seine Schleife ziehen.“\nSantas Stimme bleibt ruhig, aber bestimmt. „Dann halten wir ihn auf. Wo ist er?“\nDavid blickt auf ein neues Signal, das auf der Konsole erscheint. „Sein Chrono-Schlitten befindet sich in der Höhle direkt unter dieser Station. Das Gravitationsfeld dort unten liegt gefährlich nahe an der Ergosphäre des Schwarzen Lochs. Wenn er ihn aktiviert, könnte die Zeitlinie dauerhaft zerbrechen.“\nMagnus deutet auf eine Luke am anderen Ende des Raumes. „Wir müssen schnell handeln.“\nBevor Santa antworten kann, leuchtet die Konsole hell auf und zeigt ein verzerrtes Zeitliniendiagramm – Bewegungen, die gemacht und dann in einem rekursiven Muster rückgängig gemacht werden. Davids Augen weiten sich. „Er hat bereits begonnen, seine Schleife zu testen. Er kehrt Momente in der Zeit um, um zu sehen, ob die Änderungen Bestand haben. Wenn wir das beheben wollen, müssen wir die Sequenz rückgängig machen und neu ausrichten.“\nIn der aktuellen Position hat Weiß gerade einen Zug abgeschlossen. Zuerst wird der letzte Zug von Weiß rückgängig gemacht, gefolgt vom letzten Zug von Schwarz. Dann wird das Spiel fortgesetzt, indem Schwarz einen Zug macht, gefolgt von einem Zug von Weiß. Der letzte Zug von Weiß muss ein Schachmatt sein. Dies ist ein Hilfe-Retraktor, bei dem beide Spieler kooperieren.\nDu musst die zwei zurückgenommenen Halbzüge in der Lösung nicht angeben, sondern nur die zwei Züge, die nach der Rücknahme vorwärts gespielt werden. Zuerst ein Zug von Schwarz, dann ein Zug von Weiß, der Schachmatt setzt.\n8/1p6/1K6/2nNk3/8/8/5n2/8 b - - 0 1"},"title":"Tag 19 - 2024 - Hilfsmatt - Retraktor"},"/2024/19/loesung/":{"data":{"":"Weiß nimmt den Zug Se3xTd5 zurück, dann nimmt Schwarz den Zug Se4xDf2 zurück. Anschließend folgt die Sequenz, die zum Matt führt, beginnend mit Schwarz:\nSe6 Sc4#"},"title":"Tag 19 - 2024 - Lösung"},"/2024/2/":{"data":{"":"Der Bildschirm flackert, während sich die Anomalie stabilisiert. David Snowell verliert keine Zeit. „Gute Arbeit, aber das ist erst der Anfang“, sagt er und deutet Ihnen und Wesley Snow, ihm tiefer in Santas Fabrik zu folgen. Sie gehen an Reihen von Elfen-Ingenieuren vorbei, die leuchtende Terminals überwachen und nervös zu den blinkenden roten Lichtern über ihnen aufblicken.\nDie drei von Ihnen betreten die Kammer der Temporalen Singularität, in deren Zentrum der Dreh- und Angelpunkt von Santas Betrieb schwebt: eine schimmernde schwarze Kugel, nicht größer als ein Bauer, die in der Luft von einem Gitter aus elektromagnetischen Spulen gehalten wird.\nDavid zeigt darauf. „Das ist die Kerr-ol-Singularität – ein stabilisiertes Schwarzes Loch. Ihre Rotation erzeugt eine Ergosphäre, einen verzerrten Bereich der Raumzeit. Darin verlangsamt sich die Zeit drastisch. Jede Sekunde außerhalb der Fabrik dehnt sich für uns zu Wochen aus. So können wir jedes Jahr Milliarden von Geschenken produzieren.“\nWesley betrachtet die wirbelnde Kugel skeptisch. „Und was passiert, wenn die Rotation stoppt?“\nDavids Gesicht wird ernst. „Die Ergosphäre kollabiert. Ohne Zeitdilatation geraten wir mit 10.000 Geschenken pro Sekunde in Verzug. Bis wir sie wieder stabilisieren, könnte die halbe Welt zu einem leeren Weihnachtsbaum aufwachen.“\nWesley sieht alarmiert aus. „Wie verhindern wir, dass das passiert?“\n„Der erste Schritt zur Stabilisierung der Singularität besteht darin, Schwarz durch Zusammenarbeit schachmatt zu setzen.“\nDies ist ein Hilfsmatt-Problem, was bedeutet, dass beide Spieler zusammenarbeiten, um das Matt zu erreichen.\nMit Schwarz am Zug: Wie kann Weiß, mit Hilfe von Schwarz, im dritten Zug mattsetzen? Schwarz spielt 3 Züge und Weiß ebenfalls 3 Züge, wobei der dritte Zug von Weiß das Matt ist.\n8/4N3/3k4/8/2R1n3/8/N5K1/8 b KQkq - 0 1"},"title":"Tag 2 - 2024 - Hilfsmatt"},"/2024/2/loesung/":{"data":{"":"1. Ke5 Tc2 2. Kd4 Sf5+ 3. Kd3 Sb4#"},"title":"Tag 2 - 2024 - Lösung"},"/2024/20/":{"data":{"":"Die Gruppe steigt tiefer in die Höhle hinab, und das Summen des Chrono-Schlittens wird mit jedem Schritt lauter. Die Wände schimmern und verzerren sich, während gravitative Störungen den Raum durchziehen und das Licht in unheimliche, fließende Muster biegen.\nDavid wirft einen Blick auf seinen Scanner. „Wir sind fast da. Die Energie des TSC erreicht ihren Höhepunkt und speist direkt in Grinchuks Schlitten.“\nVor ihnen öffnet sich die Höhle zu einer riesigen Kammer. In der Mitte steht der Chrono-Schlitten auf einer Plattform, umgeben von wirbelnden Energiebahnen. Seine Struktur vibriert, während er Energie direkt aus der Ergosphäre des Schwarzen Lochs zieht. Das Licht biegt sich auf unnatürliche Weise, sodass es wirkt, als existiere der Schlitten an mehreren Orten gleichzeitig.\nMagnus pfeift leise. „Ich habe schon gefährliche Maschinen gesehen, aber das hier… das fühlt sich lebendig an.“\nSanta tritt vor, ruhig wie immer. „Dann stoppen wir ihn, bevor Grinchuk ihn aktiviert. David, was sehen wir hier?“\nDavid studiert das nahegelegene Konsolenpanel, seine Stimme angespannt. „Er fixiert die Zeitlinie in einer Schleife. Wenn der Schlitten startet, wird er sich an das Schwarze Loch binden und die Zeit dauerhaft zerbrechen.“\nWesley deutet auf die Steuerung. „Also, was ist der Plan?“\nBevor David antworten kann, leuchtet die Konsole hell auf und projiziert ein verzerrtes Schachbrett in die Luft. Die Figuren flimmern und verändern sich, doch etwas stimmt nicht. Magnus neigt den Kopf. „Wo ist der schwarze König?“\nDavids Scanner piept unregelmäßig. „Die gravitativen Störungen haben den schwarzen König gelöscht. Seid vorsichtig, dieses Brett ist instabil.“\nSanta tritt näher und betrachtet die leuchtende Projektion. „Dann müssen wir ihn wiederherstellen. Finden wir heraus, wo der König hingehört, und setzen wir Matt.“\nAufgabe: Weiß ist am Zug, doch der schwarze König fehlt. Platziere den schwarzen König so, dass Weiß in zwei Zügen ein erzwungenes Matt setzen kann. Es muss unabhängig von der Antwort von Schwarz gelingen. Gib das Feld an, auf dem der schwarze König platziert werden soll, gefolgt von dem ersten Zug von Weiß, der zum Matt in zwei führt.\nBeispiel: e8, Ta1\nLeider lässt sich in ChessBase 16 nur eine gültige Stellung aufbauen, weshalb das Bild aus Lichess stammt. Die FEN ist dennoch korrekt. 2b5/8/2r1p3/4Bp2/1p1P4/2b1N3/2QPN3/R2K4 w - - 0 1"},"title":"Tag 20 - 2024 - Stellungsmatt"},"/2024/20/loesung/":{"data":{"":"schwarzer König auf h1 -\u003e 1.Kc1 b3 2. Dd1 h1, Kc1"},"title":"Tag 20 - 2024 - Lösung"},"/2024/21/":{"data":{"":"Der verzerrte Brummton des Chrono-Schlittens wird mit jeder Sekunde lauter. Die Gravitationskräfte verstärken sich, drücken gegen sie, als würde die Zeit selbst sich wehren. Wesley wischt sich den Schweiß von der Stirn. „Wie lange noch?“\nDavid hebt nicht den Blick von den Kontrollen. „Wir sind nah dran, aber irgendetwas stimmt nicht. Die Feldsignaturen sind falsch – fast so, als würde das System versuchen, etwas zu verbergen.“\nMagnus runzelt die Stirn. „Was bedeutet das?“\nBevor David antworten kann, rastet der schwarze König ein. Die Energiebahnen um den Schlitten flackern und schwächen sich ab, doch statt zu stabilisieren, beginnt sich unter ihm ein zweites Feld zu bilden – eine schwach schimmernde Blase aus Zeitdilatation.\nEine Gestalt erscheint innerhalb des Feldes.\nZunächst ist sie kaum sichtbar, doch als sich das Feld stabilisiert, erstarren die Anwesenden. Innerhalb der schimmernden Verzerrung steht Wesley Snow – ein perfektes Spiegelbild des Wesley, der neben ihnen steht. Sein Gesicht ist blass, sein Ausdruck desorientiert, als wäre für ihn keine Zeit vergangen.\nDer Wesley außerhalb des Feldes, der sie die ganze Zeit begleitet hat, weicht instinktiv zurück, seine Stimme ungewöhnlich ruhig. „Das ist nur ein weiteres Zeit-Echo, richtig?“\nDavids Scanner piept wild, und er wird bleich. „Nein. Das ist der echte Wesley. Er ist in einer zeitzerdielten Schleife gefangen gewesen.“\nDie Gruppe dreht sich zu dem Wesley neben ihnen, der plötzlich grinst – ein Grinsen, das sich zu etwas allzu Vertrautem verzerrt.\nMagnus starrt ihn an, seine Stimme heiser. „Nein. Nicht schon wieder.“\nDer Wesley tritt vor, seine Gestalt flackert einen Moment, und seine Stimme trieft vor Spott. „Überraschung.“\nDas ist ein schachloses Hilfspatt. Schachs sind nicht erlaubt, sodass, wenn die einzigen legalen Züge in einem normalen Spiel Schachs ohne Matt wären, die Stellung als Patt gilt. Beide Spieler kooperieren. Schwarz zieht zuerst, dann Weiß. Drei Züge für jeden. Der letzte Zug von Weiß muss Patt sein\n8/5kPP/8/3K4/8/8/4p2p/8 b - - 0 1"},"title":"Tag 21 - 2024 - Schachlos"},"/2024/21/loesung/":{"data":{"":"e1=S h8=D 2. Sg2 Dd8 3. h1=L g8=T="},"title":"Tag 21 - 2024 - Lösung"},"/2024/22/":{"data":{"":"Die Höhle ist totenstill, während die Gruppe Wesley anstarrt—oder vielmehr Grinchuk. Seine Verkleidung flackert und verschwindet, und seine wahre Gestalt kommt endlich zum Vorschein. Grinchuks Grinsen ist breit, seine Augen funkeln vor Triumph.\n„Ihr dachtet wirklich, ich würde denselben Fehler zweimal machen?“ höhnt er. „Euren lieben Wesley in einer Zeitschleife gefangen zu halten, war mein Meisterstück. Er hat keine Sekunde gealtert. Für ihn ist keine Zeit vergangen.“\nSanta tritt vor, seine Stimme hart wie Eisen. „Und was war dein Ziel, Grinchuk?“\nGrinchuk macht eine dramatische Geste in Richtung des Chrono-Schlittens, der nun vor instabiler Energie pulsiert. „Warum sollte ich mich mit einem einzigen Weihnachten zufriedengeben, wenn ich alle kontrollieren kann? Vergangenheit, Gegenwart, Zukunft—meine zum Umschreiben, meine zum Beherrschen.“\nMagnus ballt die Fäuste. „Du hast bereits verloren. Wir haben deine Rätsel gelöst und das Feld des Schlittens gestört.“\nGrinchuk lacht—ein hartes, höhnisches Geräusch. „Ihr habt noch gar nichts gelöst. Ich kann die Schleife immer noch aktivieren, und wenn ich das tue, wird das schwarze Loch mich im Zentrum der Zeit verankern. Ich werde der Anfang und das Ende von Weihnachten!“\nDavids Stimme durchdringt das Chaos. „Wir können ihn noch aufhalten. Wenn wir die Verbindung des Schlittens zum schwarzen Loch trennen, wird die Zeitschleife kollabieren und Wesley befreien.“\nSanta nickt. „Dann bringen wir es zu Ende.“\nGrinchuk fletscht die Zähne und tritt zum Chrono-Schlitten zurück. Das Terminal daneben leuchtet auf und zeigt ein Schachbrett mit seltsam angeordneten Figuren. Magnus starrt auf die Anzeige und runzelt die Stirn. „Was ist das?“\nDavid betrachtet das Brett. „Das ist mit den Logikschaltkreisen des Schlittens verbunden. Eine Seite kann noch rochieren. Wir müssen herausfinden, welche Seite Weiß ist, um es zu übersteuern.“\nMagnus beugt sich vor, sein Selbstvertrauen wächst. „Das ist einfach. Lass mich nur—“\nBevor er den Satz beenden kann, grinst Grinchuk und drückt einen Knopf am Schlitten. Das Brett flackert, und die Farben der Figuren verändern sich heftig, glühen rot und blau, als würden sie durch ein Prisma brechen.\nMagnus tritt zurück, erschrocken. „Was… was hast du getan?“\nGrinchuks Grinsen wird noch breiter. „Ich habe die visuelle Ausgabe mithilfe von Gravitationsverzerrungen vom TSC angepasst. Die Farben, die ihr seht, sind jetzt vollständig relativ zu eurer Perspektive. Viel Glück dabei, herauszufinden, welche welche ist.“\nDavids Scanner piept schnell. „Er hat die Logik des Brettes manipuliert und eine Wellenlängenverzerrung erzeugt. Wir müssen herausfinden, wer Weiß ist, basierend auf der Position.“\nSanta tritt vor, seine Stimme ruhig. „Konzentriert euch. Eine Seite kann noch rochieren. Das ist der Schlüssel.“\nGrinchuk zieht sich zum Schlitten zurück, lachend, während die Höhle erzittert. „Viel Glück, Santa. Die Zeitlinie gleitet euch aus den Fingern.“\nWir wissen nicht, von welcher Seite wir das Brett sehen. Eine Seite kann noch rochieren. Wer ist Weiß?\nversteckt"},"title":"Tag 22 - 2024 - Rückläufig"},"/2024/22/loesung/":{"data":{"":"Angesichts der Position der Könige muss der Spieler, der rochieren kann, Schwarz sein.\nAngenommen, Rot ist Weiß (was bedeutet, dass Blau rochieren kann). Der letzte Zug von Blau (auch bekannt als Schwarz) muss h7-h6 gewesen sein, aber was war der Zug davor? Es muss ein Zug mit einer Figur gewesen sein, die sich nicht mehr auf dem Brett befindet. Es kann nicht der blaue Springer gewesen sein, der auf b3 geschlagen wurde, da Rot zwei Rücknahmen (plus die Rücknahme des Schachs) benötigt, bevor dieser Springer auf das Brett zurückkehren kann. Daher muss der vorletzte Zug von Schwarz mit dem fehlenden Turm erfolgt sein, und die letzten Züge müssen (in umgekehrter Reihenfolge) gewesen sein: Ng8-f6+, h7-h6, Nh6xRg8, Rh8-g8. Allerdings bedeutet die Tatsache, dass der fehlende Turm auf g8 geschlagen wurde, dass die Position eine “falsche Parität” hat. Tatsächlich kann gezeigt werden, dass beide Spieler eine gerade Anzahl an Zügen gemacht haben, um die Diagrammstellung zu erreichen, sodass Rot am Zug sein müsste (da Rot das Spiel begonnen hat), aber Blau steht im Schach!\nWir schließen daraus, dass Rot nicht Weiß sein kann, also muss Blau Weiß sein. Es ist leicht zu erkennen, dass die Stellung in diesem Fall keine Legitimationsprobleme aufweist."},"title":"Tag 22 - 2024 - Lösung"},"/2024/23/":{"data":{"":"Die Höhle summt vor instabiler Energie, Licht und Ton verzerren sich auf unnatürliche Weise. Die Gruppe arbeitet fieberhaft an der Konsole, während der Chrono-Schlitten vor Kraft vibriert und Energie aus der Verbindung zum schwarzen Loch zieht.\nDavids Scanner piept scharf, während er schnell tippt. „Grinchuks Störung hat den TSC beschädigt. Wenn wir die Verbindung des Schlittens zum schwarzen Loch jetzt nicht kappen, wird die Zeitlinie zerbrechen.“\nSanta stabilisiert die Gruppe mit seiner ruhigen Präsenz. „Dann bringen wir das zu Ende. Egal, was es kostet.“\nGrinchuk steht nahe dem Schlitten, sein Grinsen unerschütterlich. „Zu Ende bringen? Ihr spielt mit Kräften, die euer Verständnis übersteigen. Alles, was ihr getan habt – alles, was ihr zu retten glaubt – hängt an einem Faden, den ich gleich durchtrennen werde.“\nPlötzlich füllt sich die Höhle mit flackernden Bildern, Zeitfragmente erscheinen und zerstreuen sich. Szenen aus Vergangenheit und Zukunft flimmern über die Wände. Eine belebte Kneipe voller Elfen, Gelächter und klirrender Krüge erscheint. Über der Tür leuchten die Worte North Pole Pub.\nMagnus legt den Kopf schief. „Wo ist das? Es heißt North Pole Pub, aber ich habe das noch nie gesehen.“\nDavid runzelt die Stirn, seine Stimme gedämpft. „Es existiert nicht… noch nicht. Die Pläne für dieses Gebiet zeigen nur Eisspeicher. Wenn wir das sehen… dann ist es aus der Zukunft.“\nDas Bild flackert erneut und zeigt kurz eine schattenhafte Gestalt am Rand der Kneipe. Grinchuk, sein Gesicht zu einem bösen Grinsen verzerrt, verschwindet, als die Vision verblasst.\nSanta betrachtet die Vision mit schwerem Blick. „Nicht nur die Zukunft. Eine Zukunft, in der Grinchuk zurückkehrt.“\nDavids Scanner piept scharf. „Grinchuks Störung hat den TSC beschädigt. Eine letzte Aufgabe bleibt – wir müssen die Verbindung des Schlittens trennen, oder die Zeitlinie zerbricht.“\nSanta nickt. „Dann bringen wir es zu Ende.“\nDie Konsole leuchtet hell auf und projiziert ein Schachbrett in die Luft. David studiert es, seine Miene angespannt. „Das ist es – die Stabilisierungslogik des TSC. Sie benötigt den Beweis, dass ein Schachmatt im siebten Zug möglich ist. Wenn wir das lösen, setzen wir das Feld zurück.“\nDies ist ein Hilfsmatt-Problem, was bedeutet, dass beide Seiten zusammenarbeiten, um ein Matt herbeizuführen.\nMit Schwarz am Zug: Wie kann Weiß, mit Unterstützung von Schwarz, im siebten Zug Matt setzen? Schwarz führt 7 Züge aus, Weiß ebenfalls 7, und der siebte Zug von Weiß ist Matt.\nBk6/bP1p1pPP/1n1P1P2/5p2/6p1/6pb/6p1/6K1 b - - 0 1"},"title":"Tag 23 - 2024 - Hilfsmatt"},"/2024/23/loesung/":{"data":{"":"f4 h8=S 2. f3 Sg6 3. fxg6 g8=L 4. g5 Le6 5. dxe6 d7 6. Kc7 b8=T 7. e5 d=D#"},"title":"Tag 23 - 2024 - Lösung"},"/2024/24/":{"data":{"":"Die Gruppe schließt die Stabilisierung der Temporalen Singularitätskammer ab. Die gravitativen Verzerrungen sind verschwunden, und das Feld des Schwarzen Lochs ist wieder in einem stabilen Zustand. Der Chronoschlitten steht still, seine Energie vollständig erschöpft.\nSanta tritt in den Kontrollraum, sein roter Mantel makellos und seine Stiefel glänzend, bereit für die lange Reise. Er überblickt die Gruppe, sein Blick voller Dankbarkeit. “Ihr habt es geschafft. Weihnachten ist vorerst sicher – und so lange wie jetzt andauert.”\nMagnus grinst. “Ein Jahr in der Blase für dich, eine einzige Nacht für uns. Du bist der Einzige, der wirklich weiß, wie weit Weihnachten reist.”\nSanta lächelt, die Last der Reise ist in seinen Augen sichtbar. “Und es ist jede Reise wert, jedes Mal.”\nDavid tritt vor, seine Stimme ernst. “Die TSC wird vorerst halten, aber Grinchuks Einmischung hat Narben in der Zeitlinie hinterlassen. Wir können nicht sicher sein, was da draußen noch ist.”\nSanta legt eine beruhigende Hand auf Davids Schulter. “Wir werden uns dem stellen, wenn es soweit ist. Für den Moment konzentrieren wir uns auf das Jetzt.”\nAls die Gruppe Santa zum Schlitten begleitet, erscheinen die flimmernden Visionen erneut – diesmal schwach, aber deutlich genug, um sie innehalten zu lassen. Die Kneipenszene aus der früheren Vision taucht wieder auf, zeigt einen älteren Magnus an einem Tisch, im Gespräch mit einem viel älteren Santa. Grinchuk steht im Hintergrund, grinsend, als plane er seinen nächsten Zug.\nMagnus flüstert: “Das bin ich. Älter. Das ist…”\nDavid beendet leise: “Der Nordpol Pub.”\nSanta betrachtet die Vision, sein Ton fest. “In hundert Jahren. Er wird zurückkehren. Und wenn er es tut, werden wir bereit sein.”\nDer Schlitten erwacht zum Leben, seine Energie stabilisiert sich zu einer perfekten Zeitdilationsblase. Die Gruppe beobachtet, wie Santa einmal winkt, der Schlitten zu einem Lichtstreifen beschleunigt. Das Gravitationsfeld krümmt sich um ihn, verzerrt die Sterne, während er im Zeitstrom verschwindet.\nFür Santa wird die Reise ein Jahr dauern. Für die anderen wird sie in einer einzigen Nacht vorübergehen.\nAls die Gruppe nach draußen in die verschneite Nacht tritt, funkeln die Sterne am Himmel heller als je zuvor. David hält inne, neigt den Kopf. “Seht ihr das?”\nWesley schaut nach oben. “Was?”\nDavid zeigt auf eine Sternenansammlung. “Da. Schwarze Kreise – nein, Leerräume. Sie blockieren das Sternenlicht.”\nMagnus verengt die Augen, sein Atem sichtbar in der kalten Luft. “Es bildet ein Muster.”\nDie Gruppe starrt, während die Leerräume schwach flimmern und sich zu einem Schachbrett anordnen. Schwarze Kreise am Himmel markieren die Positionen unsichtbarer Figuren. Wesley grinst, seine Stimme voller Ehrfurcht. “Ein Spiel. Die Sterne zeigen uns ein Spiel.”\nMagnus lacht leise, schüttelt den Kopf. “Noch ein letztes Rätsel, hm? Das Universum konnte uns keine Ruhe lassen.”\nDavid nickt, lächelt schwach. “Dann rekonstruieren wir es. Eine letzte Herausforderung.”\nWährend die Gruppe unter dem sternenklaren Himmel steht, beginnt Santa seine einjährige Reise.\nBeginnend von der Ausgangsposition, gib eine Sequenz von Zügen an, die diese Position nach dem 6. Zug von Schwarz erreicht (6 Züge für Weiß und 6 Züge für Schwarz). Alle Figuren, sowohl Weiß als auch Schwarz, werden hier als schwarze Punkte dargestellt.\nversteckt"},"title":"Tag 24 - 2024 - Spielbeweis"},"/2024/24/loesung/":{"data":{"":"e4 f5 2. e5 Sf6 3. exf6 Kf7 4. fxe7 Kg6 5. e8=T Df6 6. Te2 Be7"},"title":"Tag 24 - 2024 - Lösung"},"/2024/3/":{"data":{"":"Die Anomalie stabilisiert sich weiter, als die Lösung des Problems ihre Wirkung zeigt. David Snowell atmet aus und schüttelt den Kopf. „Ich kann nicht glauben, dass du das gelöst hast. Grinchuk lässt dieses Mal wirklich nichts aus, oder?“\nWesley Snow sinkt in einen nahegelegenen Stuhl und blickt dich ungläubig an. „Es ist viel zu früh für so harte Rätsel. Ist das sein Konzept von einem Aufwärmen?“\nMagnus Carolsen betritt den Raum, nippt an einer Tasse Kakao und sagt: „Weißt du, wenn die Singularität mit der Zeit spielt, verzweigt sich jede Entscheidung in unzählige Möglichkeiten. In einigen hast du es perfekt gelöst. In anderen vielleicht nicht. Aber was zählt, ist, dass die Zeitlinien, in denen du es weiter versuchst, die sind, die zum Erfolg führen.“\nDavid nickt. „Genau. Jedes gelöste Rätsel bringt uns dem Ergebnis näher, das wir brauchen. Grinchuks ganzer Plan basiert darauf, dass die Leute aufgeben – dass sie den Kampf nach einem Fehltritt abbrechen. Aber solange du dranbleibst, formst du die Zeitlinie in unserem Sinne.“\nDer Monitor piept, unterbricht die Unterhaltung und zeigt eine neue Schachstellung auf dem Bildschirm. Eine Notiz von Grinchuk erscheint daneben: „Mal sehen, ob du der Versuchung widerstehen kannst, zu gewinnen.“\nWesley Snow wirkt verwirrt. „Was soll das bedeuten? Sollen wir nicht gewinnen?“\nDavid runzelt die Stirn und betrachtet die Notiz. „Nicht dieses Mal. Das ist einer von Grinchuks typischen Tricks. Anstatt mattzusetzen, musst du es vollständig vermeiden – aber nur für drei Züge. Ein falscher Schritt, und du verlierst, indem du gewinnst.“\n„Ein Rätsel, bei dem wir bestraft werden, wenn wir gewinnen?“\nIn diesem Problem versucht Weiß, ein Matt in 3 Zügen oder weniger zu vermeiden! Ähnlich wie bei Hilfsmatts arbeiten beide Spieler zusammen.\nGib eine Zugfolge an, bei der Weiß beginnt und nach dem dritten Zug von Weiß nicht mattgesetzt wurde. Hier ist die Stellung auf Lichess. Wir empfehlen, die Züge auf dem Lichess-Analysebrett auszuführen. Wenn es nach dem dritten Zug von Weiß kein Schachmatt ist, hast du die richtige Lösung.\n2k1NRBN/2P1PKpP/P1PPP1Pb/6p1/6p1/8/5p2/8 w - - 0 1"},"title":"Tag 3 - 2024 - Versuchung"},"/2024/3/loesung/":{"data":{"":"1. a7 f1=L 2. a8=L Ba6 3. Lb7+ Lxb7 4. cxb7+ Kxb7"},"title":"Tag 3 - 2024 - Lösung"},"/2024/4/":{"data":{"":"David betrachtet den Monitor. „Die Kräfte des Schwarzen Lochs schwanken. Sie erzeugen Widerstand in den Stabilisatoren – sie drücken gegen die Ausrichtung, die wir brauchen.“\nWesley Snow wirft einen nervösen Blick auf den Monitor. „Und wenn sie sich nicht ausrichten?“\nDavid verzieht das Gesicht. „Dann breitet sich die Gravitationskraft unkontrolliert aus. Teile der Fabrik könnten in Richtung des Ereignishorizonts gezogen werden.“\nDer Monitor flackert und zeigt eine Schachstellung. David deutet darauf. „Wir müssen den Widerstand ausgleichen, indem wir Balance erzwingen. Diese Stellung zeigt genau, was wir tun müssen. Weiß muss Schwarz dazu zwingen, Matt zu setzen, selbst wenn Schwarz es zu verhindern versucht. Löse das, und es wird uns zeigen, wie wir das System stabilisieren.“\nDies ist ein Selbstmatt. Gib die Zugfolge an, die Schwarz dazu zwingt, Weiß im zweiten Zug Matt zu setzen (sowohl Weiß als auch Schwarz machen jeweils 2 Züge). Weiß beginnt. Beachte, dass Schwarz versucht, das Matt zu vermeiden, aber keine andere Möglichkeit hat.\nQ5bk/6b1/5B2/8/8/8/8/KB6 w - - 0 1"},"title":"Tag 4 - 2024 - elbstmatt"},"/2024/4/loesung/":{"data":{"":"1. Dh1+ Lh7 2. La2 Lxf6#"},"title":"Tag 4 - 2024 - Lösung"},"/2024/5/":{"data":{"":"Nach Stunden angespannter Berechnungen und Fehlersuche gönnen sich du und Wesley eine Pause in einem der Aufenthaltsräume der Fabrik.\nIn der Ecke unterhält Magnus Carlsen eine kleine Gruppe von Elfen mit einer Simultanvorstellung. Als ihr den Raum betretet, blickt er auf und grinst. „Ah, gerade rechtzeitig! Lust auf eine Partie?“, fragt er und deutet auf das Schachbrett.\nWesley winkt ab. „Nein danke, Carlsen. Ich habe für heute genug von Schachaufgaben.“\nEr lacht und wendet sich an dich: „Aber ich habe ein kleines Schachproblem für dich. Möchtest du es versuchen?“\nDie Elfen rücken näher, als Carlsen die Stellung auf dem Brett aufbaut. „Es ist einfach“, sagt er. „Weiß muss einen Bauern aufs Brett setzen und in zwei Zügen mattsetzen.“\nWeiß muss einen Bauern hinzufügen und in zwei Zügen mattsetzen. Beachte, dass dies kein Hilfsmatt ist. Weiß muss unabhängig von der Antwort von Schwarz ein Matt erzwingen können. Gib zuerst das Feld an, auf dem der Bauer platziert werden soll, und dann die Zugfolge, die zum Matt in zwei Zügen führt, wobei Weiß beginnt und im zweiten Zug mattsetzt.\n8/5B2/6p1/5N1k/6p1/6R1/4K3/8 w - - 0 1"},"title":"Tag 5 - 2024 - Platzierung Matt"},"/2024/5/loesung/":{"data":{"":"Weiß fügt einen Bauern auf h2 hinzu und spielt 1. h4 gxh3 2. Lxg6#"},"title":"Tag 5 - 2024 - Lösung"},"/2024/6/":{"data":{"":"Nach der Herausforderung von Magnus Carlsen stürzt David Snowell aus dem Flur herein, sein Gesicht bleich. „Das müsst ihr euch ansehen.“\nEin Bild erscheint auf dem Bildschirm: Schachspieler blitzen für einen Augenblick auf, bevor sie wieder verschwinden. Figuren formieren sich auf einem Schachbrett. Magnus tritt vor, seine Augen verengen sich. „Das ist… Capablanca. Und das ist Lasker. Das ist ihre Partie von 1921. Was macht sie hier?“\nBevor jemand antworten kann, flackert das Brett, und etwas Seltsameres passiert. Ein Feld flimmert neben dem Schachbrett in die Existenz, losgelöst von jeglicher Reihe oder Linie. „Was ist das?“ fragt Wesley und starrt darauf.\nDavid neigt den Kopf. „Es ist… unmöglich. Das ist ein Feld, wo kein Feld sein sollte. Es ist, als würde die Raumzeit sich verzerren und Fragmente schaffen, die nicht dazugehören. Das muss mit der Störung der Singularität zusammenhängen.“\nDas Brett flackert erneut, Figuren ordnen sich in eine neue Position um. Das losgelöste Feld leuchtet schwach, als ob es darauf wartet, verankert zu werden. Ein leises Summen hallt durch den Flur. „Das ist der gesperrte Bereich“, erklärt David und zeigt auf die Tür am Ende des Flurs. „Wenn wir herausfinden, wohin dieses Feld gehört, könnte es der Schlüssel sein, es zu öffnen.“\nAufgabe: Füge ein neues Feld am Rand des Bretts hinzu, entweder direkt über, unter, links oder rechts von einem existierenden Feld. Weiß zieht zuerst und setzt in 2 Zügen matt. Zuerst: Bestimme die Position des neuen Feldes (zum Beispiel a0, wenn es unterhalb von a1 liegt, oder a9, wenn es oberhalb von a8 liegt; i2, wenn es rechts von h2 liegt, oder z5, wenn es links von a5 liegt). Nachdem das Feld hinzugefügt wurde, gib die Zugfolge an, die zu einem erzwungenen Matt in 2 führt.\n3k2N1/5K2/8/8/5Q2/8/8/8 w - - 0 1"},"title":"Tag 6 - 2024 - neuer Quadrant"},"/2024/6/loesung/":{"data":{"":"Das hinzugefügte Feld ist e9. Se9 Kxe9 2. Dc7#."},"title":"Tag 6 - 2024 - Lösung"},"/2024/7/":{"data":{"":"Mit dem Rätsel gelöst, entriegelt sich die Tür, und die Gruppe betritt den abgesperrten Bereich. Die Luft wirkt dicht, geladen, als würde ein Sturm bevorstehen. Während ihr tiefer hineingeht, beginnen geisterhafte Bilder zu flackern – Elfen bei der Arbeit, Baupläne alter Entwürfe, sogar Schachbretter mitten im Spiel.\nMagnus bleibt abrupt stehen und starrt auf eines der flackernden Bilder. “Das ist Alekhine. Ich würde diese Partie überall erkennen – das ist sein Spiel von 1929 gegen Bogoljubov. Aber wie kann es hier sein?”\nDavid runzelt die Stirn und beobachtet, wie ein anderes Bild langsam erscheint und verschwindet. “Das sind nicht nur Bilder. Es sind… Echos der Vergangenheit. Die Raumzeit scheint sich hier durch Störungen zu verformen. Die TSC biegt in diesem Bereich die Realität.”\nDie Gruppe drängt weiter vor, und die Erscheinungen werden immer lebendiger. An einem Punkt erscheint eine schattenhafte Gestalt am Ende des Korridors, regungslos stehend. “Ist das… Garry Kaspelf?” flüstert Wesley.\nDavid zeigt auf das Brett in der Ferne. “Das muss ein Überbleibsel eines unserer früheren Experimente mit der Singularität sein. Wir haben versucht, damit sequentielle Züge zu simulieren – einer Seite erlaubt, mehrere Züge hintereinander zu machen, um Zeitschleifen zu untersuchen. Jetzt müsst ihr Schwarz durch neun präzise Züge führen, um ein Patt für Weiß vorzubereiten.”\nDas ist eine Seriehelppatt-Aufgabe. Schwarz führt 9 Züge hintereinander aus, ohne Antwort von Weiß, wonach Weiß mit einem Zug Patt setzt.\nZwischenzeitliche Schachs (Checks) sind nicht erlaubt, das heißt, Schwarz darf nur beim 9. Zug Schach geben.\n8/1p2k2P/5NK1/8/8/8/8/8 w - - 0 1"},"title":"Tag 7 - 2024 - Seriehelppatt"},"/2024/7/loesung/":{"data":{"":"1. b5 2. b4 3. b3 4. b2 5. b1=T 6.Tb8 7.Th8 8.Kf8 9. Tg8+ hxg8=S"},"title":"Tag 7 - 2024 - Lösung"},"/2024/8/":{"data":{"":"Die letzte Tür öffnet sich knarrend und gibt den Blick auf das Zeitforschungslabor frei. Verstaubte Konsolen summen leise, ihre Bildschirme zeigen verzerrte Bilder: Elfen beim Spielzeugbau, antike Pläne und Fragmente von Schachpartien flackern wie halb erinnerte Träume.\nDavid tritt zum zentralen Terminal, sein Gesicht ernst. “Das ist kein Zufall. Die Störung der Singularität löst unsere Wahrnehmung von Zeit auf.”\nMagnus verengt die Augen bei einem Bild von Capablanca, eingefroren mitten in einem Zug. “Also… wir sehen die Vergangenheit?”\nDavid schüttelt den Kopf. “Nicht nur die Vergangenheit. Lineare Zeit ist nur unsere Art, sie zu erleben – Moment für Moment. In Wirklichkeit existiert alles – Vergangenheit, Gegenwart und Zukunft – gleichzeitig, wie Punkte auf einer Kurve. Was wir sehen, ist das Zusammenbrechen dieser Kurve, Fragmente, die in das Jetzt übergehen.”\nWesley blickt auf eine schwache Projektion eines geschmückten Baumes. “Was passiert, wenn wir das nicht beheben können?”\nDavid zögert, dann antwortet er. “Es ist nicht nur dieses Weihnachten, das gefährdet ist. Wenn die Kurve vollständig kollabiert, könnten alle Weihnachten, vergangene und zukünftige, verschwinden. Jedes Geschenk… weg.”\nDer Raum fällt in Schweigen, bis ein fernes Geräusch durchdringt – ein tiefes, rhythmisches Summen aus einer versiegelten Kammer im hinteren Teil des Labors.\nWesley erstarrt. “Was ist das?”\nDavid runzelt die Stirn. “Da sollte niemand sein, aber das ist… die Kryostasekammer.”\nAusgehend von der Anfangsstellung soll eine Partie konstruiert werden, in der Weiß im 6. Zug mit einem Zug mattsetzt, der sowohl ein Abzugsschach als auch ein en-passant-Schlag ist."},"title":"Tag 8 - 2024 - Konstruktion"},"/2024/8/loesung/":{"data":{"":"Es gibt verschiedene Ansätze. Die Grundidee ist die folgende: 1. e4 e5 2. Dh5 Sc6 3. g4 d6 4. g5 Kd7 5. Lh3+ f5 6. gxf6#"},"title":"Tag 8 - 2024 - Lösung"},"/2024/9/":{"data":{"":"Die rhythmischen Summtöne werden lauter, als du dich der versiegelten Kammer im hinteren Bereich des Labors näherst. David hält an einer nahegelegenen Konsole an und ruft Baupläne auf. „Die Kryostasekammer“, murmelt er. „Das ist der Ort, an dem wir den Weihnachtsmann zwischen den Weihnachtsfesten eingefroren halten.“\nWesley blinzelt verwirrt. „Eingefroren? Warum?“\nDavid tippt schnell und ruft Dateien auf dem Bildschirm auf. „Der Weihnachtsmann ist kein Elf. Er hat nicht Jahrhunderte Zeit wie wir. Die Kryostase hält ihn in perfektem Zustand für das nächste Weihnachtsfest. Er wacht nur auf, um sich auf seine jährliche Reise vorzubereiten, und geht nach getaner Arbeit wieder in die Stase.“\nMagnus hebt eine Augenbraue. „Das wirkt … extrem.“\nDavid zuckt mit den Schultern. „So hat er es geschafft, Generationen von Geschenken zu liefern, ohne wie wir anderen zu altern.“\nVerwirrt näherst du dich der Kammer, während die Luft immer kälter wird. Ein Warnlicht blinkt auf dem Bedienfeld. „Das ist seltsam“, sagt David stirnrunzelnd. „Das System sollte noch nicht aktiv sein. Der Weihnachtsmann sollte erst am 24. Dezember aufwachen.“\nMagnus tritt vor, um das Bedienfeld zu untersuchen. „Warum summt es dann, als würde es auf Hochtouren arbeiten?“\nDavid wirft dir einen Blick zu. „Irgendetwas stimmt nicht. Wir müssen da rein. Das Passwort, um hineinzukommen, sind die Züge, um aus der Ausgangsstellung diese Position zu erreichen.“\nGeben Sie eine Abfolge von Zügen an, die nach dem 7. Zug von Schwarz zu dieser Stellung führt (7 Züge für Weiß und 7 Züge für Schwarz).\nrn1qkbnr/ppp1pp1p/3p4/8/8/7P/PPPPPP1P/RNBQKb1R w KQkq - 0 1"},"title":"Tag 9 - 2024 - Beweis"},"/2024/9/loesung/":{"data":{"":"Sh3 d6 2. Tg1 Lxh3 3. gxh3 g5 4. Tg3 g4 5. Tg2 g3 6. Tg1 g2 7. Th1 gxf1=L"},"title":"Tag 9 - 2024 - Lösung"},"/2024/epilog/":{"data":{"":"Als die Gruppe zurück zur Fabrik geht, ertönt ein leises Ping von Davids Scanner. Er bleibt stehen, die Stirn gerunzelt. „Das dürfte nicht möglich sein. Die TSC hat gerade ein Signal gesendet.“\nMagnus dreht sich um. „Ein Signal? Von wo?“\nDavids Stimme ist kaum mehr als ein Flüstern. „Aus der Zukunft. Hundert Jahre von jetzt an.“\nDer Bildschirm zeigt eine einzige Zeile Text: „Sucht den Glockenturm. – Wesley Snow“\nDie Gruppe tauscht Blicke aus, das Gewicht der Botschaft lastet schwer auf ihnen. Magnus durchbricht die Stille, seine Stimme fest. „Wir werden es uns merken. Und wir werden bereit sein.“\nDer Schnee fällt lautlos, während die Botschaft verblasst, zurückbleiben nur die Sterne über ihnen und das leise Summen der Temporalen Singularitätskammer."},"title":"Epilog"}}