{"/en/2024/":{"data":{"":"Day 1 first advent Day 2 Day 3 Day 4 Day 5 Day 6 Day 7 Day 8 second advent Day 9 Day 10 Day 11 Day 12 Day 13 Day 14 Day 15 third advent Day 16 Day 17 Day 18 Day 19 Day 20 Day 21 Day 22 fourth advent Day 23 Day 24 holy night Epilogue"},"title":"2024"},"/en/2024/1/":{"data":{"":"The North Pole hums with energy as the elves prepare for another Christmas season. Inside Santa’s Factory, gears whir and lights flash as thousands of toys roll off assembly lines. But something feels… off.\nDavid Snowell, one of Santa’s top engineer elves, bursts into the main hall where you and Wesley Snow are chatting by the candy cane dispenser. “We’ve got a problem,” David says, holding up a blinking red device. “There’s an anomaly in the Temporal Singularity Chamber.”\nThe elves fall silent. The TSC is the heart of the operation, containing the black hole that slows time for the factory. Without it, the elves wouldn’t have enough time to produce billions of gifts before Christmas.\nDavid leads you to the TSC control room. On the monitors, you see distorted readings and glitching images of the black hole. Beside the control panel, a chess position and a torn santa mask.\n“This must be Grinchuk,” Wesley says. “He’s back.”\nDavid nods. “We’ve got to stabilize the TSC before it collapses. The first step is getting to this position after White’s 6th move.”\nrnb1kbnr/ppp1pppp/8/3p1q2/8/5PK1/PPPPP1PP/RNBQ1BNR b kq - 0 1"},"title":"Day 1 - Proof Game"},"/en/2024/1/solution/":{"data":{"":"f3 d6 2. Kf2 Qd7 3. Ke3 Qh3 4. Ke4 d5+ 5. Kf4 Qf5+ 6. Kg3 *"},"title":"Day 1 - Solution"},"/en/2024/10/":{"data":{"":"The heavy door to the Cryostasis Chamber hisses open, releasing a gust of icy air. Inside, a cylindrical pod glows faintly, frost clinging to its surface. Santa lies within, perfectly still, his iconic suit faintly illuminated by the chamber’s light.\nWesley peers closer. “He’s still frozen… but look at this.” He points to a tangle of wires dangling from the pod’s control panel. Several components appear dislodged, and a small tool rests nearby, as if someone had been tampering with it.\nDavid’s face darkens. “This wasn’t an accident. Someone’s been here.”\nMagnus narrows his eyes. “Grinchuk?”\n“Possibly,” David replies, carefully inspecting the damage. “If this isn’t fixed, the chamber could fail entirely. Santa would get stuck in his frozen state.”\nWesley frowns. “Can we fix it?”\nDavid nods. “We have to. But we’ll need to reroute power and recalibrate the system. The first step is to find a way to checkmate Black here.”\nThis is a helpmate problem, which means that both players cooperate to achieve mate.\nWith Black to move first, how can White, with Black’s assistance, mate on the fourth move? Black plays 4 moves and White 4, and White’s 4th move is mate.\nk1B5/1p6/8/3p4/3P2Pp/2n1KP1P/pppp1p1R/B3b3 b - - 0 1"},"title":"Day 10 - Hilfsmatt"},"/en/2024/10/solution/":{"data":{"":"b1=R Bxc3 2. d1=R Bxe1 3. f1=R Bg3 4. c1=R Rxa2#"},"title":"Day 10 - Solution"},"/en/2024/11/":{"data":{"":"David examines the console, his expression tense. “Rerouting the power didn’t work. Santa really isn’t supposed to wake up for another two weeks. The cryo-systems are programmed for a gradual thaw, perfectly timed for the 24th.”\nMagnus frowns. “But with the tampering, waiting isn’t an option, is it?”\nDavid shakes his head. “No. If we don’t get him out of there now, he may never awaken. We’ll have to wake him early this year.”\nDavid starts typing commands into the console. “This won’t be a full wake-up yet, but we’ll begin the thawing sequence. Once the chamber adjusts to normal conditions, we’ll bring him out.”\nThe chamber hums softly as warm air circulates, frost slowly retreating from the glass. Santa’s figure remains motionless inside, the rhythmic pulsing of the console lights the only sign that the process has begun.\nDavid steps back, watching the frost slowly melt. “Now we wait. This is going to take a couple of hours.”\nMagnus settles into a chair nearby. “Well, while we’re waiting, let’s keep our minds sharp. Let’s try to solve this chess problem.”\nIn the current position, White has just completed a move. First, retract the last move made by White, followed by retracting the last move made by Black. Then, resume the game by making a legal move for Black, and finally, a move for White. White’s last move should deliver checkmate. This is a help-retractor, so both players cooperate.\nYou do not need to provide the two retracted half-moves in the solution, only the two moves being played forward after the retraction. First a Black move, then a White move, delivering checkmate.\n2rkQ3/1K6/8/8/8/8/3R1P2/4b3 b - - 0 1"},"title":"Day 11 - Retractor"},"/en/2024/11/solution/":{"data":{"":"We first retract dxRe8=Q, and then e2-e1=B. Then, we play forward 1. e1=R dxc8=N#"},"title":"Day 11 - Solution"},"/en/2024/12/":{"data":{"":"The soft hiss of the chamber fills the room as the frost continues to melt. Inside, Santa’s features grow clearer—his thick beard covered in icy droplets, his face peaceful yet pale.\nDavid reviews the console’s diagnostics. “The thawing process is proceeding smoothly. He should regain consciousness soon.”\nMagnus leans on the console. “How do you think he’s going to react?”\nWesley grimaces. “Not well. Imagine waking up thinking you’re ready for Christmas, only to find out it’s two weeks too early.”\nDavid exhales. “We’ll deal with it when it happens. For now, we’ve got to make sure this process is flawless.”\nThe hum of the chamber shifts, signaling the final phase. Inside, Santa’s fingers twitch slightly, a sign of life returning.\nMagnus glances at the others. “Here we go.”\nThis is a serieshelpmate. Black plays 9 consecutive moves, without reply from White, after which White mates in one. Both players cooperate.\nNo intermediate checks are allowed, meaning that Black can only check on the 9th move.\nK7/1p6/2k1P3/3NP3/2PP4/5N2/8/8 b - - 0 1"},"title":"Day 12 - Serieshelpmate"},"/en/2024/12/solution/":{"data":{"":"b5 2. b4 3. b3 4. b2 5. b1=R 6. Re1 7. Rxe5 8. Rxe6 9. Rd6 Ne5#"},"title":"Day 12 - Solution"},"/en/2024/13/":{"data":{"":"Santa’s eyes flutter open, and he slowly sits up in the cryostasis pod. He blinks, his gaze sweeping the room. “Sleigh ready?” he asks.\nWesley looks to David, who steps forward. “Not exactly, sir. It’s… December 13th.”\nSanta’s brow furrows, confusion flickering across his face. “December 13th? Why am I awake so early?”\nDavid hesitates before replying, his tone measured. “There’s been an anomaly. We’ll explain everything shortly, but first, we need to make sure you’re fully recovered.”\nSanta steps out of the pod, brushing frost from his crimson sleeves. “Anomaly or not, I assume the standard checks are in order?”\nDavid turns to you, speaking quietly. “After a year in cryostasis, we always run cognitive tests to make sure everything’s functioning properly.”\nMagnus gestures to the chessboard set up nearby. “You know the drill.”\nSanta approaches the board with calm familiarity. “Same procedure as last year?”\nDavid sets the pieces carefully. “Same procedure as every year, James. White to move, protected pieces can’t move, mate in two.”\nSanta leans forward, his sharp eyes scanning the position. “My name is not James. But let’s begin.”\nIn this position, any piece protected by another piece of the same color may not move. A pinned piece, however, does not function as a protector, because it cannot move. That means that you can move a piece that is only protected by pinned pieces. White to force a mate in 2. Only the key move (meaning White’s first move) is needed for the solution.\nNote that this is not a helpmate, so White must be able to force a mate regardless of Black’s response.\nkB6/P7/P7/3N4/1P1rp3/1B1pP3/1K1P4/8 w - - 0 1"},"title":"Day 13 - Key Mate"},"/en/2024/13/solution/":{"data":{"":"Kb1"},"title":"Day 13 - Solution"},"/en/2024/14/":{"data":{"":"Santa sits in the lab’s central chair, his expression a mixture of concern and curiosity as David explains the anomalies. After a moment, Santa leans back, stroking his beard. “An anomaly serious enough to wake me early. Tell me the full story.”\nMagnus chimes in. “It’s not just the cryo-chamber. We’re dealing with interference from the singularity, affecting time and space throughout the factory.”\nYou, still piecing the situation together, ask Santa, “Why do you need to be frozen every year anyway?”\nDavid glances at you, his expression thoughtful. “It’s time you knew how the operation works,” he begins. “We’ve engineered an environment around the sleigh that isolates him and his reindeer from the rest of the universe. The system manipulates spacetime itself.”\nMagnus adds, “The field compresses the space ahead of the sleigh and stretches it behind. This creates a localized spacetime bubble where everything inside moves independently from the outside world.”\nDavid nods. “Inside this bubble, the sleigh can reach speeds close to the speed of light. As it accelerates, time dilation kicks in. For Santa, time slows dramatically – what feels like a full year inside the bubble passes as only a single night outside.”\nSanta nods, then gestures to the chessboard nearby. “Speaking of time… How did this position occur?”\nGiven that this position could be reached in a legal game of chess, what was the last move played? You only need to provide the last move for the last player who moved, not for both. You need to also provide the square the piece moved from. If a piece was captured, you need to also provide the piece captured.\nFor example: If a Queen on b2 moved to a3, you write Qb2-a3. If a Queen on b2 captured a Rook on a3, you write Qb2xRa3 (Qxa3 is not enough).\n3bkN1K/pppprp1p/4p1p1/8/8/8/8/8 w - - 0 1"},"title":"Day 14 - Retrograde"},"/en/2024/14/solution/":{"data":{"":"The only possibility is White playing Kg8xQh8."},"title":"Day 14 - Solution"},"/en/2024/15/":{"data":{"":"You lean forward, captivated. “So he experiences an entire year in what feels like a single night for us?”\nDavid continues. “Exactly. The sleigh’s environment is engineered to make this possible. The bubble stabilizes using an immense amount of energy to bend spacetime around it, effectively allowing Santa to travel vast distances while experiencing time at a slower rate.”\nSanta chuckles. “And believe me, a year of delivering presents is as exhausting as it sounds.”\nYour eyes widen. “But if he experiences a year every Christmas, wouldn’t he… age faster than everyone else?”\nDavid’s expression grows serious. “That’s where the cryostasis chamber comes in. After each trip, Santa is placed in suspended animation. His metabolic activity is reduced to almost nothing, keeping him biologically in sync with everyone else. Without it, he’d age two years for every one year that passes for us.”\nMagnus tilts his head. “And how do you maintain this bubble while moving so fast?”\nDavid gestures toward a holographic schematic. “The field is anchored by a controlled distortion in spacetime. By precisely manipulating gravitational forces, we create a stable gradient around the sleigh, ensuring the bubble remains intact while shielding Santa from the effects of external acceleration.”\nSanta smiles. “It’s not easy, but it works. That said, I trust you’ve all got this under control while I prepare?”\nDavid exchanges a glance with Magnus. “We’re doing everything we can. But it’s clear that someone, likely Grinchuk, is tampering with the mechanisms.”\nThis is a selfmate. Give the sequence of moves that forces Black to mate White on the fourth move (both White and Black makes 4 moves). White makes the first move. Note that Black tries to avoid mating, but will have no other option.\n8/1p5Q/bP2P3/1p1B2P1/1B6/4kNp1/5pP1/5K2 w - - 0 1"},"title":"Day 15 - Selfmate"},"/en/2024/15/solution/":{"data":{"":""},"title":"Day 15 - Solution"},"/en/2024/16/":{"data":{"":"Santa straightens, his commanding presence filling the room as he studies the faces around him. “If Grinchuk’s meddling with the sleigh’s systems, we need to know how deep his sabotage goes. I assume you’ve already started an investigation?”\nDavid nods. “We’ve been monitoring the anomalies, but the TSC’s interference is making it harder to isolate his tampering.”\nMagnus gestures to the console. “And the distortions are growing worse. Just walking across the factory, I saw what looked like a younger version of myself working on a schematic I haven’t touched in years. These time fragments are spilling over into everything.”\nSanta strokes his beard thoughtfully. “The TSC’s instability… is it localized to the factory?”\nDavid shakes his head. “Not entirely. It’s primarily here, but the effects ripple outward. The sleigh’s field is tied to the TSC, and if we can’t stabilize it, your journey this year will be unpredictable. You could be delivering gifts in 1843 or 3984 instead of 2024.”\nBefore Santa can respond, an alert flashes on the console. A distorted image appears on the monitor – a flickering chessboard, partially obscured by static. But this isn’t just any board. The pieces are arranged in a position Magnus immediately recognizes.\n“That’s from a game I played decades ago,” Magnus says. “But I don’t remember how I got to this position.”\nStarting from the initial position, give a sequence of moves that reaches this position after White’s 8th move (8 moves for White and 7 moves for Black).\nrn2kbnr/p2ppppp/1p6/8/2pP4/5PP1/PP2PB1P/RN2KBNR w KQkq - 0 1"},"title":"Day 16 - Proof Game"},"/en/2024/16/solution/":{"data":{"":"c4 b5 2. Qb3 bxc4 3. Qb6 cxb6 4. d4 Qc7 5. Be3 Qg3 6. fxg3 Bb7 7. Bf2 Bf3 8. gxf3"},"title":"Day 16 - Solution"},"/en/2024/17/":{"data":{"":"The group gathers around the console, its screen flickering faintly as the last puzzle fades away. David Snowell’s face is tense. “These distortions aren’t just random echoes anymore. They’re becoming more specific. They’re targeting us.”\nMagnus steps forward, pointing to the console where a faint timeline diagram appears. “Look here. The fragments—these distortions—are clustering around moments where the TSC was operating at maximum capacity. It’s like the black hole’s ergosphere is pulling events from the timeline and projecting them into our reality.”\nWesley frowns. “You’re saying the TSC is dragging pieces of time into the present? How is that even possible?”\nDavid turns, his expression grim. “The black hole at the TSC’s core isn’t just slowing time anymore. Its ergosphere—the warped region around the event horizon—is destabilized. Normally, it contains and regulates the factory’s dilation effects, giving us the decades we need to prepare for Christmas. But now… it’s leaking.”\nSanta’s eyes narrow. “Leaking into where?”\nDavid gestures at the distorted images on the console. “Here. Into us. The distortions are fragments of past and future moments being pulled into the present. Grinchuk’s tampering is amplifying this effect, destabilizing spacetime itself.”\nMagnus leans back, his expression dark. “And if we can’t stop it?”\nDavid pauses. “Eventually, the factory’s time dilation could collapse entirely. If that happens, the black hole will draw the entire timeline into its ergosphere. It could erase Christmas across all history.”\nBefore the group can respond, another alert flashes on the console. Coordinates appear on the screen. David’s eyes widen. “These lead to the old North Pole Research Station! It’s where the TSC prototypes were first built. If Grinchuk’s there, he might have access to the early designs.”\nThe group gathers their gear and sets out into the icy wilderness. The snow grows heavier, the winds howling around them. As they approach the coordinates, Wesley halts suddenly, pointing to a faint glimmer in the distance. “What’s that?”\nMagnus peers through the snow. “It looks like a chessboard?”\nThe group moves closer, and the outline becomes clear. A giant chessboard, all pieces buried in snow, stretches before them. The pieces are scattered across it, all coated in white, their original colors obscured by frost and ice.\nDavid crouches beside one of the pieces. “This game is over, so a checkmate has happened, but it’s impossible to tell which side each piece belongs to.”\nOne of the kings is checkmated. Colour in the pieces, working out which are black and which are white. Give the coordinates for the white pieces, then a comma, and then the last move that was played that resulted in the position shown.\nExample format: c1 e5 f7, Qf7#.\nNR1BK3/3Q4/BKP5/P7/8/8/8/1R4B1 w - - 0 1"},"title":"Day 17 - Coloring"},"/en/2024/17/solution/":{"data":{"":"White pieces: Rook on b1, pawn on c6, Queen on d7, King on e8, Bishop on g1. The rest of the pieces are Black. The last move played was bxc6# en passant!"},"title":"Day 17 - Solution"},"/en/2024/18/":{"data":{"":"The group enters the abandoned research station, its air unnaturally still. David sweeps his scanner across the room, his expression tightening. “The gravitational distortions are stronger here—closer to the black hole’s field than I thought. This place is a nexus.”\nSanta steps forward, his voice steady. “And Grinchuk’s been here. Look.”\nAt the center of the room sits a chessboard, glowing faintly. Around it, old machinery hums with residual energy, and schematics line the walls—crude diagrams of the TSC. Magnus squints at the chessboard, the pieces oddly arranged.\nDavid frowns, examining the nearby console. “These systems are running feedback loops. He’s been using this station to amplify the black hole’s gravitational waves. If he keeps this up, the TSC will lose its ability to control time dilation entirely.”\nThe group gathers around the glowing chessboard, its pieces frozen mid-game. Wesley points at it, frowning. “Another of Grinchuk’s puzzles?”\nDavid scans the board. “It’s worse than that. The TSC’s distortions are pulling this board between two timelines – one where checks didn’t exist, and one where they did. The result? Checks are illegal unless it’s checkmate.”\nSanta steps forward, his voice steady. “Then let’s fix it. Solve the puzzle, and let’s restore some order to this chaos.”\nThis is a checkless helpmate. Any check that’s not a checkmate is against the rules. Both players still cooperate to achieve checkmate, but without checks. Consequently, a check is also considered checkmate, and therefore legal, if the only responses are non-checkmating checks! Black moves first, then White. Four moves each. White’s last move must be checkmate.\nK7/5p1B/5n1P/3k4/8/2p5/8/7n b - - 0 1"},"title":"Day 18 - Checkless"},"/en/2024/18/solution/":{"data":{"":"Ng8 Bb1 2. c2 h7 3. cxb1=B hxg8=N 4. Be4 Ne7#"},"title":"Day 18 - Solution"},"/en/2024/19/":{"data":{"":"The energy pulsing through the station begins to fade, but the air remains heavy with tension. David studies the readings on the console. “These gravitational distortions aren’t just random. Grinchuk is channeling the TSC’s power into something bigger.”\nSanta steps closer. “What exactly is he building?”\nDavid hesitates, pulling up a schematic on the console. The glowing lines form the outline of a sleigh, surrounded by swirling energy fields. “It’s… a sleigh,” David mutters. “But this isn’t like yours, Santa. It’s designed to exploit time dilation directly.”\nMagnus leans in, “Explain.”\nDavid takes a deep breath and points to the outline on the console. “Grinchuk’s Chrono-Sleigh is trying to replicate your sleigh’s ability to bend spacetime, but with one difference. Instead of slowing time for himself, he’s aiming to create a closed time loop - one where he controls every moment of Christmas, rewriting history to make himself the central figure.”\nWesley stares at the schematic. “So he’s not just trying to sabotage us. He’s trying to… erase us?”\nDavid nods grimly. “If he succeeds, the TSC will lose its stabilization anchor, and the black hole’s gravitational pull will drag the entire timeline into his loop.”\nSanta’s voice is calm but firm. “Then we stop him. Where is he?”\nDavid glances at a new signal appearing on the console. “His Chrono-Sleigh is in the cavern directly beneath this station. The gravitational field down there is dangerously close to the black hole’s ergosphere. If he activates it, the timeline could fracture permanently.”\nMagnus gestures to a hatch at the far side of the room. “We have to act quick.”\nBefore Santa can respond, the console flares brightly, showing a distorted timeline diagram—moves made, but reversing themselves in a recursive pattern. David’s eyes widen. “He’s already begun testing his loop. He’s reversing moments in time to see if the changes hold. If we want to fix this, we’ll need to undo the sequence and realign it.”\nIn the current position, White has just completed a move. First, undo the last move made by White, followed by undoing the last move made by Black. Then, resume the game by making a move for Black, and finally, a move for White. White’s last move should deliver checkmate. This is a help-retractor, so both players cooperate.\nYou do not need to provide the two retracted half-moves in the solution, only the two moves being played forward after the retraction. First a Black move, then a White move, delivering checkmate\n8/1p6/1K6/2nNk3/8/8/5n2/8 b - - 0 1"},"title":"Day 19 - Retractor - Helpmate"},"/en/2024/19/solution/":{"data":{"":"White retracts Ne3xRd5, then Black retracts Ne4xQf2. Then follows the sequence leading to mate, with Black starting: 1. Ne6 Nc4#"},"title":"Day 19 - Solution"},"/en/2024/2/":{"data":{"":"The screen flickers as the anomaly stabilizes. David Snowell wastes no time. “Good work, but this is only the beginning,” he says, gesturing for you and Wesley Snow to follow him deeper into Santa’s Factory. You pass rows of elf engineers monitoring glowing terminals, all casting nervous glances at the blinking red lights overhead.\nThe three of you enter the Temporal Singularity Chamber, where the centerpiece of Santa’s operation floats: a shimmering black sphere, no larger than a pawn, suspended in midair by a lattice of electromagnetic coils. David points to it. “This is the Kerr-ol Singularity - a stabilized black hole. Its spin creates an ergosphere, a warped region of spacetime. Inside, time slows dramatically. Every second outside the factory stretches into weeks for us. It’s how we produce billions of gifts every year.”\nWesley studies the swirling orb, skeptical. “And if the spin stops?”\nDavid’s face grows serious. “The ergosphere collapses. Without time dilation, we’ll fall behind by 10,000 gifts every second. By the time we stabilize it again, half the world could wake up to an empty tree on Christmas.”\nWesley looks alarmed. “How do we stop that from happening?”\n“The first thing we need to do stabilize the singularity is checkmating Black by cooperation.”\nThis is a helpmate problem, which means that both players cooperate to achieve mate.\nWith Black to move first, how can White, with Black’s assistance, mate on the third move? Black plays 3 moves and White 3, and White’s 3rd move is mate.\n8/4N3/3k4/8/2R1n3/8/N5K1/8 b KQkq - 0 1"},"title":"Day 2 - Helpmate"},"/en/2024/2/solution/":{"data":{"":"1. Ke5 Rc2 2. Kd4 Nf5+ 3. Kd3 Nb4#"},"title":"Day 2 - Solution"},"/en/2024/20/":{"data":{"":"The group descends deeper into the cavern, the hum of the Chrono-Sleigh growing louder with every step. The walls shimmer and warp as gravitational distortions ripple through the space, bending light into eerie, flowing patterns.\nDavid glances at his scanner. “We’re almost there. The TSC’s power is peaking, and it’s feeding straight into Grinchuk’s sleigh.”\nAhead, the cavern opens into a vast chamber. At its center, the Chrono-Sleigh sits on a platform surrounded by swirling beams of energy, its structure vibrating as it draws power directly from the black hole’s ergosphere. The light here bends unnaturally, making it feel as if the sleigh exists in multiple places at once.\nMagnus whistles under his breath. “I’ve seen dangerous machines before, but this… this feels alive.”\nSanta steps forward, steady as ever. “Then we stop it before Grinchuk activates it. David, what are we looking at?”\nDavid studies the console nearby, his voice tight. “He’s locking the timeline into a loop. If the sleigh launches, it’ll tether itself to the black hole and fracture time permanently.”\nWesley points at the controls. “So what’s the plan?”\nBefore David can answer, the console flares brightly, projecting a distorted chessboard into the air. The pieces shimmer and shift, but something is wrong. Magnus tilts his head. “Where’s the Black king?”\nDavid’s scanner beeps erratically. “The gravitational distortions have erased the Black king. Be cautious, this board is unstable.”\nSanta steps closer, studying the glowing projection. “Then we need to restore it. Find where the king belongs, and give checkmate.”\nIt’s White to move, but the Black king is missing. Place the Black king so that White can force a mate in two moves. White to move, then Black, and White’s second move is checkmate. Note that this is not a helpmate, so White must be able to force a mate regardless of Black’s response. Provide the square at which to place the Black king, followed by a comma, and White’s first move leading to the mate in two.\nExample format: e8, Ra1\n2b5/8/2r1p3/4Bp2/1p1P4/2b1N3/2QPN3/R2K4 w - - 0 1"},"title":"Day 20 - Placement mate"},"/en/2024/20/solution/":{"data":{"":"black King on h1 -\u003e 1.Kc1 b3 2. Qd1 h1, Kc1"},"title":"Day 20 - Solution"},"/en/2024/21/":{"data":{"":"The distorted hum of the Chrono-Sleigh growing louder with every second. The gravitational forces intensify, pressing against them as though time itself is fighting back. Wesley wipes sweat from his brow. “How much longer?”\nDavid doesn’t look up from the controls. “We’re close, but something doesn’t add up. The field signatures are off—almost like the system’s trying to hide something.”\nMagnus frowns. “What does that mean?”\nBefore David can answer, the Black king clicks into place. The energy beams around the sleigh flicker and weaken, but instead of stabilizing, a second field begins to form beneath it—a faint, shimmering bubble of time dilation.\nA figure appears inside the field.\nAt first, it’s barely visible, but as the field stabilizes, the group freezes. Inside the shimmering distortion is Wesley Snow—a perfect mirror of the Wesley standing beside them. His face is pale, his expression disoriented as though no time has passed for him.\nThe Wesley outside the field, the one who has accompanied them the whole time, steps back instinctively, his voice unusually calm. “It’s just another time echo, right?”\nDavid’s scanner beeps wildly, and he pales. “No. That’s the real Wesley. He’s been trapped in a time-dilated loop.”\nThe group turns to the Wesley beside them, who suddenly grins—a grin that twists into something far too familiar.\nMagnus stares at him, his voice hoarse. “No. Not again.”\nThe Wesley steps forward, his form glitching momentarily, his voice dripping with mockery. “Surprise.”\nThis is a checkless help-stalemate. Checks are illegal, so if the only moves that would be legal in a normal game of chess are non-checkmating checks, the position is considered stalemate. Both players cooperate. Black moves first, then White. Three moves each. White’s last move must be stalemate.\n8/5kPP/8/3K4/8/8/4p2p/8 b - - 0 1"},"title":"Day 21 - Checkless"},"/en/2024/21/solution/":{"data":{"":"e1=N h8=Q 2. Ng2 Qd8 3. h1=B g8=R="},"title":"Day 21 - Solution"},"/en/2024/22/":{"data":{"":"The cavern is deathly silent as the group stares at Wesley—or rather, Grinchuk. His disguise flickers and fades, revealing his true form at last. Grinchuk’s grin is wide, his eyes alight with triumph.\n“You really thought I’d make the same mistake twice?” he sneers. “Trapping your dear Wesley in a time loop was my finest touch. He hasn’t aged a second. For him, no time has passed at all.”\nSanta steps forward, his voice like iron. “And what was your endgame, Grinchuk?”\nGrinchuk gestures dramatically at the Chrono-Sleigh, now pulsing with unstable energy. “Why settle for a single Christmas when I can control all of them? Past, present, future—mine to rewrite, mine to rule.”\nMagnus clenches his fists. “You’ve already lost. We’ve undone your puzzles, and we’ve disrupted the sleigh’s field.”\nGrinchuk laughs—a harsh, mocking sound. “You haven’t undone anything yet. I can still activate the loop, and when I do, the black hole will anchor me at the center of time. I’ll become the beginning and the end of Christmas!”\nDavid’s voice cuts through the chaos. “We can still stop him. If we sever the sleigh’s connection to the black hole, it’ll collapse the time loop and free Wesley.”\nSanta nods. “Then let’s end this.”\nGrinchuk snarls, stepping back toward the Chrono-Sleigh. The terminal beside it lights up, displaying a chessboard with its pieces arranged in a strange position. Magnus peers at the display, frowning. “What’s this?”\nDavid studies the board. “This is tied to the sleigh’s logic circuits. One side can still castle. We need to identify which side is White to override it.”\nMagnus leans in, his confidence growing. “Simple enough. Let me just—”\nBefore he can finish, Grinchuk smirks and presses a button on the sleigh. The board flickers, and the colors of the pieces shift violently, glowing red and blue as if passing through a prism.\nMagnus steps back, startled. “What… what did you just do?”\nGrinchuk’s grin widens. “I’ve adjusted the visual output using gravitational distortions from the TSC. Now, the colors you see are entirely relative to your perspective. Good luck figuring out which is which.”\nDavid’s scanner beeps rapidly. “He’s tampered with the board’s logic, creating a wavelength distortion. We’ll have to deduce who’s White based on the position itself.”\nSanta steps forward, his tone steady. “Focus. One side can still castle. That’s our key.”\nGrinchuk retreats to the sleigh, laughing as the cavern trembles. “Good luck, Santa. The timeline is slipping away.”\nWe don’t know which side we see the board from. One side can still castle. Who is White?\nhidden"},"title":"Day 22 - Retrograde"},"/en/2024/22/solution/":{"data":{"":"Given the kings’ position, whoever can castle must be Black.\nAssume Red is White (thus Blue can castle). The last move by Blue (a.k.a. Black) must have been h7-h6, but what was the move before that? It must have been with a piece that is no longer on the board. It cannot have been with the blue knight that was captured on b3 as Red needs 2 retractions (plus the check retraction) before that knight can appear on the board. Therefore, the second last move by Black must have been with the missing rook and the last moves must have been (in reverse order): Ng8-f6+, h7-h6, Nh6xRg8, Rh8-g8. However, the fact that the missing rook was captured on g8 means the position has “the wrong parity”. Indeed, it can be shown that both players made an even number of moves to reach the diagram position, so it should be Red to move (since Red started the game), but Blue is in check!\nWe conclude Red cannot be White, thus Blue must be White. It is not hard to see that the position has no legality issues in that case."},"title":"Day 22 - Solution"},"/en/2024/23/":{"data":{"":"The cavern hums with unstable energy, light and sound warping unnaturally. The group works frantically at the console, the Chrono-Sleigh vibrating with power as it draws from the black hole’s tether.\nDavid’s scanner emits sharp beeps as he types rapidly. “Grinchuk’s interference has corrupted the TSC. If we don’t sever the sleigh’s connection to the black hole now, the timeline will fracture.”\nSanta steadies the group with his calm presence. “Then we finish this. No matter what it takes.”\nGrinchuk stands near the sleigh, his grin unwavering. “Finish it? You’re playing with forces beyond your comprehension. Everything you’ve done—everything you think you’ve saved—rests on a thread I’m about to sever.”\nSuddenly, the cavern fills with flickering images, fragments of time spilling into view. Scenes from past and future ripple across the walls. A bustling pub filled with elves, laughter, and the clinking of mugs appears. The words North Pole Pub glow above the door.\nMagnus tilts his head. “Where is that? It says North Pole Pub, but I’ve never seen it before.”\nDavid frowns, his voice low. “It doesn’t exist… not yet. The plans for that area are still ice storage. If we’re seeing this… it’s from the future.”\nThe image flickers again, briefly showing a shadowy figure at the edge of the pub. Grinchuk, his face twisted into a wicked grin, vanishes as the vision fades.\nSanta studies the vision, his gaze heavy. “Not just the future. A future where Grinchuk returns.”\nDavid’s scanner emits sharp beeps. “Grinchuk’s interference has corrupted the TSC. One last task remains—we need to sever the sleigh’s connection, or the timeline fractures.”\nSanta nods. “Then let’s finish this.”\nThe console flares brightly, projecting a final chessboard into the air. David studies it, his expression tight. “This is it—the TSC’s stabilizer logic. It needs proof that checkmate can happen on the 7th move. If we solve this, we reset the field.”\nThis is a helpmate problem, which means that both players cooperate to achieve mate.\nWith Black to move first, how can White, with Black’s assistance, mate on the seventh move? Black plays 7 moves and White 7, and White’s 7th move is mate.\nBk6/bP1p1pPP/1n1P1P2/5p2/6p1/6pb/6p1/6K1 b - - 0 1"},"title":"Day 23 - Helpmate"},"/en/2024/23/solution/":{"data":{"":"f4 h8=N 2. f3 Ng6 3. fxg6 g8=B 4. g5 Be6 5. dxe6 d7 6. Kc7 b8=R 7. e5 d=Q#"},"title":"Day 23 - Solution"},"/en/2024/24/":{"data":{"":"The group finalizes the stabilization of the Temporal Singularity Chamber. The gravitational distortions have faded, and the black hole’s field has returned to a steady state. The Chrono-Sleigh sits inert, its power fully drained.\nSanta steps into the control room, his red coat pristine and his boots shining, ready for the long journey ahead. He surveys the group, his gaze full of gratitude. “You’ve done it. Christmas is safe for now, and for as long as now lasts.”\nMagnus smirks. “A year in the bubble for you, a single night for us. Makes you the only one who truly knows how far Christmas travels.”\nSanta smiles, the weight of the journey visible in his eyes. “And it’s a journey worth taking, every time.”\nDavid steps forward, his voice more somber. “The TSC will hold for now, but Grinchuk’s interference has left scars in the timeline. We can’t be certain what’s still out there.”\nSanta places a reassuring hand on David’s shoulder. “We’ll face it when it comes. For now, let’s focus on the present.”\nAs the group walks Santa to the sleigh, the flickers appear once more—this time faint, but clear enough to make them stop. The pub scene from the earlier vision reappears, showing an older Magnus seated at a table, talking to a much older Santa. Grinchuk stands in the background, smirking as though plotting his next move.\nMagnus whispers, “That’s me. Older. That’s…”\nDavid finishes quietly, “The North Pole Pub.”\nSanta looks at the vision, his tone steady. “One hundred years from now. He’ll return. And when he does, we’ll be ready.”\nThe sleigh hums to life, its energy stabilizing into a perfect time-dilation bubble. The group watches as Santa waves once, the sleigh accelerating into a streak of light. The gravitational field bends around him, warping the stars as he disappears into the timestream.\nFor Santa, the journey will take a year. For the others, it will pass in a single night.\nAs the group steps outside into the snowy night, the stars above shimmer brighter than ever. David pauses, tilting his head. “Do you see that?”\nWesley looks up. “See what?”\nDavid points to a cluster of stars. “There. Black circles – no, voids. They’re blocking out the starlight.”\nMagnus narrows his eyes, his breath visible in the cold air. “It’s forming a pattern.”\nThe group stares as the voids flicker faintly, aligning into what looks like a chessboard. Black circles on the sky mark the positions of invisible pieces. Wesley grins, his voice tinged with awe. “A game. The stars are showing us a game.”\nMagnus chuckles, shaking his head. “One last puzzle, huh? The universe couldn’t let us rest.”\nDavid nods, smiling faintly. “Then let’s reconstruct it. One final challenge.”\nAs the group stands beneath the starlit sky, Santa begins his yearlong journey.\nStarting from the initial position, give a sequence of moves that reaches this position after Black’s 6th move (6 moves for White and 6 moves for Black). All pieces, both White and Black, are here displayed as black dots.\nhidden"},"title":"Day 24 - Proof Game"},"/en/2024/24/solution/":{"data":{"":"e4 f5 2. e5 Nf6 3. exf6 Kf7 4. fxe7 Kg6 5. e8=R Qf6 6. Re2 Be7"},"title":"Day 24 - Solution"},"/en/2024/3/":{"data":{"":"The anomaly settles further as the solution to the problem takes effect. David Snowell exhales, shaking his head. “I can’t believe you cracked that one. Grinchuk really isn’t holding back this time, is he?”\nWesley Snow slumps into a nearby chair, looking at you with disbelief. “It’s way too early for puzzles that hard. Is this his idea of a warm-up?”\nMagnus Carolsen walks in, sipping a mug of cocoa, saying, “You know, when the singularity messes with time, every choice branches the universe out into countless possibilities. In some of them, you solved it perfectly. In others, maybe not. But what matters is that the timelines where you keep trying are the ones that lead to success.”\nDavid nods. “Exactly. Every solved puzzle nudges us closer to the outcome we need. Grinchuk’s entire plan relies on people giving up – on abandoning the fight after one stumble. But as long as you stay in it, you’re still shaping the timeline in our favor.”\nThe monitor beeps, interrupting the conversation, and flashes a new chess position on the screen. A note from Grinchuk appears alongside it: “Let’s see if you can resist the temptation to win.”\nWesley Snow is confused. “What does that mean? Aren’t we supposed to win?”\nDavid frowns, studying the note. “Not this time. This is one of Grinchuk’s signature tricks. Instead of delivering mate, you need to avoid it entirely - but only for three moves. One wrong step, and you’ll lose by succeeding.”\n“A puzzle where we’re punished for winning?”\nIn this problem, White tries to avoid mating in 3 moves or fewer! Like for helpmates, both players cooperate.\nGive a sequence of moves where White starts and has not mated after White’s third move. Here is the position on lichess. We recommend carrying out the moves on the Lichess analysis board. If it’s not checkmate after White’s third move, you have the correct answer.\n2k1NRBN/2P1PKpP/P1PPP1Pb/6p1/6p1/8/5p2/8 w - - 0 1"},"title":"Day 3 - Temptation"},"/en/2024/3/solution/":{"data":{"":"1. a7 f1=B 2. a8=B Ba6 3. Bb7+ Bxb7 4. cxb7+ Kxb7"},"title":"Day 3 - Solution"},"/en/2024/4/":{"data":{"":"David studies the monitor. “The black hole’s forces are fluctuating. It’s creating resistance in the stabilizers - pushing against the alignment we need.”\nWesley Snow glances nervously at the monitor. “And if they don’t align?”\nDavid grimaces. “Then the gravitational pull spreads uncontrollably. Parts of the factory could be dragged toward the event horizon.”\nThe monitor flickers, displaying a chess position. David points to it. “We need to counteract the resistance by forcing balance. This position shows exactly what we need to do. White must force Black to deliver mate, even though Black will fight it. Solve this, and it’ll guide how we stabilize the system.”\nThis is a selfmate. Give the sequence of moves that forces Black to mate White on the second move (both White and Black makes 2 moves). White makes the first move. Note that Black tries to avoid mating, but will have no other option.\nQ5bk/6b1/5B2/8/8/8/8/KB6 w - - 0 1"},"title":"Day 4 - Selfmate"},"/en/2024/4/solution/":{"data":{"":"T.B.A."},"title":"Day 4 - Solution"},"/en/2024/5/":{"data":{"":"After hours of tense calculations and troubleshooting, you and Wesley take a breather in one of the factory’s living rooms.\nIn the corner, Magnus Carolsen is entertaining a small crowd of elves with a simultaneous exhibition. He glances up as you enter, grinning. “Ah, just in time! Care for a game?” he asks, gesturing at the board.\nWesley waves him off. “No thanks, Carolsen. I’ve had my fill of chess puzzles for the day.”\nHe chuckles and turns to you, saying, “But I do have a little chess problem for you. Care to try?”\nThe elves lean in as Carolsen sets up the position on the board. “It’s simple,” he says. “White needs to add a pawn to the board and deliver mate in two moves.”\nWhite to add a pawn and mate in 2. Note that this is not a helpmate, so White must be able to force a mate regardless of Black’s response. First give the square at which to place the pawn, and then the sequence of moves leading to the mate in 2.\n8/5B2/6p1/5N1k/6p1/6R1/4K3/8 w - - 0 1"},"title":"Day 5 - Placement Mate"},"/en/2024/5/solution/":{"data":{"":"T.B.A."},"title":"Day 5 - Placement Mate"},"/en/2024/6/":{"data":{"":"After Magnus Carolsen’s challenge, David Snowell rushes in from the corridor, his face pale. “You need to see this.”\nAn image appears on the screen, chess players appearing for a split second at a time before disappearing. Pieces assembling on a board. Magnus steps forward, his eyes narrowing. “That’s… Capablanca. And that’s Lasker. This is their game from 1921. What’s it doing here?”\nBefore anyone can answer, the board glitches, and something stranger happens. A square flickers into existence next to the chessboard, detached from any file or rank. “What is that?” Wesley asks, staring.\nDavid tilts his head. “It’s… impossible. That’s a square where no square should be. It’s like spacetime is warping, creating fragments that don’t belong. This must be tied to the singularity’s interference.”\nThe board flickers again, pieces rearranging themselves into a new position. The detached square glows faintly, as if waiting to be anchored. A faint hum resonates through the corridor. “That’s the restricted section,” David explains, pointing at the door at the end of the corridor. “If we figure out where that square belongs, it might just be the key to opening it.”\nAdd one square to the edge of the board, directly above, below, left, or right of an existing square. Then White moves first, mating in 2. First, specify the location of the new square. For example, write a0 or a9 if it’s below a1 or above a8, i2 if it’s to the right of h2, or z5 if it’s to the left of a5 (use z for squares left of the a-file). Once the square is added, provide the sequence of moves leading to a forced mate in 2.\n3k2N1/5K2/8/8/5Q2/8/8/8 w - - 0 1"},"title":"Day 6 - Add a square"},"/en/2024/6/solution/":{"data":{"":"The square is added on e9. Ne9 Kxe9 2. Qc7#."},"title":"Day 6 - Solution"},"/en/2024/7/":{"data":{"":"With the puzzle solved, the door unlocks, and the group steps into the restricted section. The air feels thick, charged, like a storm is about to break. As you move further in, ghostly images begin to flicker—elves working, schematics of old designs, even glimpses of chessboards mid-game.\nMagnus stops in his tracks, staring at one of the flickers. “That’s Alekhine. I’d know that game anywhere - it’s his 1929 match with Bogoljubov. But how is it here?”\nDavid frowns, watching another image fade in and out. “These aren’t just images. They’re… echoes of the past. Spacetime must be warping under the interference. The TSC is bending reality in this area.”\nThe group presses on, and the apparitions grow more vivid. At one point, a shadowy figure appears at the end of the corridor, standing motionless. “Is that… Garry Kaspelf?” Wesley whispers.\nDavid points to the board in the distance. “This must be a remnant of one of our earlier experiments with the singularity. We tried using it to simulate sequential moves - letting one side play multiple times in a row to study temporal loops. Now, you’ll need to guide Black through nine precise moves to set up a stalemate for White.”\nThis is a serieshelpstalemate. Black plays 9 consecutive moves, without reply from White, after which White stalemates in one!\nNo intermediate checks are allowed, meaning that Black can only check on the 9th move\n8/1p2k2P/5NK1/8/8/8/8/8 w - - 0 1"},"title":"Day 7 - Seriehelppatt"},"/en/2024/7/solution/":{"data":{"":"T.B.A."},"title":"Day 7 - Solution"},"/en/2024/8/":{"data":{"":"The final door creaks open, revealing the Temporal Research Lab. Dusty consoles hum weakly, their screens alive with warped images – elves building toys, ancient schematics, and fragments of chess matches flickering like half-remembered dreams.\nDavid moves to the central terminal, his face grim. “This isn’t random. The singularity’s interference is unraveling our perception of time.”\nMagnus narrows his eyes at an image of Capablanca, frozen mid-move. “So… we’re seeing the past?”\nDavid shakes his head. “Not just the past. Linear time is just how we experience it – moment by moment. In reality, everything – past, present, and future – exists at once, like points on a curve. What we’re seeing is that curve collapsing in on itself, fragments bleeding into the now.”\nWesley glances at a faint projection of a decorated tree. “What happens if we can’t fix this?”\nDavid hesitates, then replies. “It’s not just this Christmas that’s at risk. If the curve collapses entirely, every Christmas, past and future, could vanish. Every gift… gone.”\nThe room falls silent until a distant sound breaks through – a low, rhythmic hum coming from a sealed chamber at the back of the lab.\nWesley stiffens. “What’s that?”\nDavid frowns. “No one’s supposed to be in there, but that’s… the Cryostasis Chamber.”\nStarting from the initial position, construct a game where White checkmates on the 6th move by playing a move that is both a discovered mate and an en passant capture."},"title":"Day 8 - Konstruktion"},"/en/2024/8/solution/":{"data":{"":"There are some transpositions, but the idea is: 1. e4 e5 2. Qh5 Nc6 3. g4 d6 4. g5 Kd7 5. Bh3+ f5 6. gxf6#"},"title":"Day 8 - Solution"},"/en/2024/9/":{"data":{"":"The rhythmic hum grows louder as you make your way toward the sealed chamber at the back of the lab. David stops at a nearby console, pulling up schematics. “The Cryostasis Chamber,” he mutters. “It’s where we keep Santa frozen between Christmases.”\nWesley blinks in confusion. “Frozen? Why?”\nDavid types rapidly, bringing up files on the display. “Santa’s no elf. He doesn’t have centuries to spare like we do. Cryostasis keeps him in perfect condition for the next Christmas. He only wakes up to prepare for his yearly trip and goes back into stasis when the work is done.”\nMagnus raises an eyebrow. “Seems… extreme.”\nDavid shrugs. “It’s how he’s managed to deliver presents for generations without aging like the rest of us.”\nPuzzled, you approach the chamber, while the air growing colder. A warning light flashes on the control panel. “That’s odd,” David says, frowning. “The system shouldn’t be active yet. Santa’s not supposed to wake up until December 24th.”\nMagnus steps forward, examining the panel. “Then why is it humming like it’s working overtime?”\nDavid glances at you. “Something’s off. We need to get in there. The password to getting in is the moves to reach this position from the initial position.”\nrn1qkbnr/ppp1pp1p/3p4/8/8/7P/PPPPPP1P/RNBQKb1R w KQkq - 0 1"},"title":"Day 9 - Proof Game"},"/en/2024/9/solution/":{"data":{"":"Nh3 d6 2. Rg1 Bxh3 3. gxh3 g5 4. Rg3 g4 5. Rg2 g3 6. Rg1 g2 7. Rh1 gxf1=B"},"title":"Day 9 - Solution"},"/en/2024/epilogue/":{"data":{"":"As the group walks back toward the factory, a faint ping comes from David’s scanner. He pauses, frowning. “That shouldn’t be possible. The TSC just sent a signal.”\nMagnus turns. “A signal? From where?”\nDavid’s voice is almost a whisper. “The future. One hundred years from now.”\nThe screen displays a single line of text: “Seek the bell tower. – Wesley Snow”\nThe group exchanges glances, the weight of the message sinking in. Magnus breaks the silence, his voice steady. “We’ll remember. And we’ll be ready.”\nThe snow falls silently as the message fades, leaving only the stars above and the quiet hum of the Temporal Singularity Chamber."},"title":"Epilogue"}}